--
-- PostgreSQL database dump
--

\restrict xj872racHczgrqSbeTbuiyOgja5yjvL1aY7mfmJhThxKHbDLvv9luO7n8tXNm7J

-- Dumped from database version 17.7 (e429a59)
-- Dumped by pg_dump version 17.7 (Debian 17.7-3.pgdg13+1)

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET transaction_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

SET default_tablespace = '';

SET default_table_access_method = heap;

--
-- Name: Account; Type: TABLE; Schema: public; Owner: neondb_owner
--

CREATE TABLE public."Account" (
    "AccountID" integer NOT NULL,
    "Name" character varying(20),
    "Password" character varying(300),
    "EntrySemester" character(3),
    "Photo" text
);


ALTER TABLE public."Account" OWNER TO neondb_owner;

--
-- Name: Account_AccountID_seq; Type: SEQUENCE; Schema: public; Owner: neondb_owner
--

CREATE SEQUENCE public."Account_AccountID_seq"
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public."Account_AccountID_seq" OWNER TO neondb_owner;

--
-- Name: Account_AccountID_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: neondb_owner
--

ALTER SEQUENCE public."Account_AccountID_seq" OWNED BY public."Account"."AccountID";


--
-- Name: Location; Type: TABLE; Schema: public; Owner: neondb_owner
--

CREATE TABLE public."Location" (
    "LocationID" integer NOT NULL,
    name character varying(20),
    "Latitude" character varying(30),
    "Longitude" character varying(30),
    "Address" character varying(50),
    "BriefDescription" character varying(3000),
    "Photo" text,
    "Tag" text[]
);


ALTER TABLE public."Location" OWNER TO neondb_owner;

--
-- Name: Record; Type: TABLE; Schema: public; Owner: neondb_owner
--

CREATE TABLE public."Record" (
    "RecordID" integer NOT NULL,
    "Semester" character(3),
    "Date" date,
    "Photo" text,
    "Description" character varying(1000),
    "Location" integer,
    "Account" integer
);


ALTER TABLE public."Record" OWNER TO neondb_owner;

--
-- Name: Record_RecordID_seq; Type: SEQUENCE; Schema: public; Owner: neondb_owner
--

CREATE SEQUENCE public."Record_RecordID_seq"
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public."Record_RecordID_seq" OWNER TO neondb_owner;

--
-- Name: Record_RecordID_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: neondb_owner
--

ALTER SEQUENCE public."Record_RecordID_seq" OWNED BY public."Record"."RecordID";


--
-- Name: RelationshipType; Type: TABLE; Schema: public; Owner: neondb_owner
--

CREATE TABLE public."RelationshipType" (
    "RelationshipTypeID" integer NOT NULL,
    "Name" text NOT NULL,
    "Source_Role" text NOT NULL,
    "Target_Role" text NOT NULL,
    "Description" text
);


ALTER TABLE public."RelationshipType" OWNER TO neondb_owner;

--
-- Name: RelationshipType_RelationshipTypeID_seq; Type: SEQUENCE; Schema: public; Owner: neondb_owner
--

ALTER TABLE public."RelationshipType" ALTER COLUMN "RelationshipTypeID" ADD GENERATED ALWAYS AS IDENTITY (
    SEQUENCE NAME public."RelationshipType_RelationshipTypeID_seq"
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1
);


--
-- Name: Students_at_record; Type: TABLE; Schema: public; Owner: neondb_owner
--

CREATE TABLE public."Students_at_record" (
    "Account" integer NOT NULL,
    "Record" integer NOT NULL
);


ALTER TABLE public."Students_at_record" OWNER TO neondb_owner;

--
-- Name: Villager; Type: TABLE; Schema: public; Owner: neondb_owner
--

CREATE TABLE public."Villager" (
    "VillagerID" integer NOT NULL,
    "Name" character varying(50),
    "Gender" character(1),
    "Job" character varying(20),
    "URL" text,
    "Photo" text,
    "Location" integer,
    "ContactInfo" text
);


ALTER TABLE public."Villager" OWNER TO neondb_owner;

--
-- Name: VillagerRelationship; Type: TABLE; Schema: public; Owner: neondb_owner
--

CREATE TABLE public."VillagerRelationship" (
    "RelationshipID" integer NOT NULL,
    "SourceVillagerID" integer NOT NULL,
    "TargetVillagerID" integer NOT NULL,
    "RelationshipTypeID" integer NOT NULL
);


ALTER TABLE public."VillagerRelationship" OWNER TO neondb_owner;

--
-- Name: VillagerRelationship_RelationshipID_seq; Type: SEQUENCE; Schema: public; Owner: neondb_owner
--

ALTER TABLE public."VillagerRelationship" ALTER COLUMN "RelationshipID" ADD GENERATED ALWAYS AS IDENTITY (
    SEQUENCE NAME public."VillagerRelationship_RelationshipID_seq"
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1
);


--
-- Name: Villager_VillagerID_seq; Type: SEQUENCE; Schema: public; Owner: neondb_owner
--

CREATE SEQUENCE public."Villager_VillagerID_seq"
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public."Villager_VillagerID_seq" OWNER TO neondb_owner;

--
-- Name: Villager_VillagerID_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: neondb_owner
--

ALTER SEQUENCE public."Villager_VillagerID_seq" OWNED BY public."Villager"."VillagerID";


--
-- Name: Villagers_at_record; Type: TABLE; Schema: public; Owner: neondb_owner
--

CREATE TABLE public."Villagers_at_record" (
    "Villager" integer NOT NULL,
    "Record" integer NOT NULL
);


ALTER TABLE public."Villagers_at_record" OWNER TO neondb_owner;

--
-- Name: locations_id_seq; Type: SEQUENCE; Schema: public; Owner: neondb_owner
--

CREATE SEQUENCE public.locations_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public.locations_id_seq OWNER TO neondb_owner;

--
-- Name: locations_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: neondb_owner
--

ALTER SEQUENCE public.locations_id_seq OWNED BY public."Location"."LocationID";


--
-- Name: student_list; Type: TABLE; Schema: public; Owner: neondb_owner
--

CREATE TABLE public.student_list (
    id integer NOT NULL,
    grade_title character varying(50),
    student_names jsonb NOT NULL,
    sort_order integer DEFAULT 0,
    updated_at timestamp without time zone DEFAULT CURRENT_TIMESTAMP
);


ALTER TABLE public.student_list OWNER TO neondb_owner;

--
-- Name: student_rosters_id_seq; Type: SEQUENCE; Schema: public; Owner: neondb_owner
--

CREATE SEQUENCE public.student_rosters_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public.student_rosters_id_seq OWNER TO neondb_owner;

--
-- Name: student_rosters_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: neondb_owner
--

ALTER SEQUENCE public.student_rosters_id_seq OWNED BY public.student_list.id;


--
-- Name: Account AccountID; Type: DEFAULT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public."Account" ALTER COLUMN "AccountID" SET DEFAULT nextval('public."Account_AccountID_seq"'::regclass);


--
-- Name: Location LocationID; Type: DEFAULT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public."Location" ALTER COLUMN "LocationID" SET DEFAULT nextval('public.locations_id_seq'::regclass);


--
-- Name: Record RecordID; Type: DEFAULT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public."Record" ALTER COLUMN "RecordID" SET DEFAULT nextval('public."Record_RecordID_seq"'::regclass);


--
-- Name: Villager VillagerID; Type: DEFAULT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public."Villager" ALTER COLUMN "VillagerID" SET DEFAULT nextval('public."Villager_VillagerID_seq"'::regclass);


--
-- Name: student_list id; Type: DEFAULT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public.student_list ALTER COLUMN id SET DEFAULT nextval('public.student_rosters_id_seq'::regclass);


--
-- Data for Name: Account; Type: TABLE DATA; Schema: public; Owner: neondb_owner
--

COPY public."Account" ("AccountID", "Name", "Password", "EntrySemester", "Photo") FROM stdin;
1	家訪小組	password	25S	\N
2	彭靖淵	\N	\N	\N
\.


--
-- Data for Name: Location; Type: TABLE DATA; Schema: public; Owner: neondb_owner
--

COPY public."Location" ("LocationID", name, "Latitude", "Longitude", "Address", "BriefDescription", "Photo", "Tag") FROM stdin;
1	加拿國小	23.00116137	121.1308733	\N	\N	\N	{}
2	臺灣基督長老教會 加拿教會	22.99946254	121.13	\N	\N	\N	{"教會,射耳祭住宿"}
3	加拿天主堂	23.001	121.1272	\N	\N	\N	{教會}
4	臺灣基督長老教會 加樂教會	23.00965613	121.1321	\N	\N	\N	{"教會,射耳祭住宿"}
5	江新武長老家	23.00925	121.1313	\N	江新武長老（Tama Lumav):\n對加拿家影響力最大的其中一個人物，不只是他在當地的德高望重、也包含他每一屆對我們的熱情，都是屈指可數的大人物\n\n以往他每次都會招待上山的各位去他家喝茶聊天、甚至吃飯烤肉，我們會唱的族語歌也幾乎都是他教給我們的，他本身也有在教小朋友唱、彙編族語歌，也會用他很獨特的幽默感跟我們溝通（不一定每個人都能跟得上就是了）\n\n興致來也會替我們當中還沒有族語名的人取名字（不一定每個人都有、我自己當初名字也不是長老給我的），有點看機緣，畢竟對長老來說，每個名字都有它背後的故事，他幫每個人取名字的時候也會跟大家描述一下背後蘊含的感覺。\n\n同樣照顧我們的還有長老老婆（Cina Valis)，本身是開理髮店的，是個傲嬌悶燒的酷酷可愛寶貝。\n	https://drive.google.com/file/d/1ECqbRY2HYvcO2odSLTI2MdoNLskg7bNs/view?usp=drive_link	{"村晚烤爐,射耳祭住宿,江氏宗親會"}
7	邱飛倞、悅慈、芷苹家	22.999381	121.128033	\N	飛倞爸爸曾經是職棒選手，現在則是泰源國中的教練，很支持我們，曾在村晚借烤爐給我們，並教我們怎麼生火。\r\n飛倞媽媽目前在文建站工作，媽媽蠻關心悅慈和芷苹在學校的狀況，可以多和媽媽聊。\r	https://drive.google.com/file/d/1KT-1WULtvUfBN3vgm2xcjOYhGIIOr5qZ/view?usp=drive_link	{村晚烤爐}
8	邱志輝、志宏家（已搬離）	22.999668	121.126568	\N	志輝爸爸曾從事室內裝潢的工作，對我們非常好客，於22冬離世。志輝媽媽(邱美伶)從事臨時工，工時不固定。志輝家因風災關係，現已搬遷至瑞源，放假時，志輝偶爾會到飛倞家住。	https://drive.google.com/file/d/1Hl9sALGkr7poNReu9H3wzJA3ObHiEgMt/view?usp=drive_link	{}
10	胡育秀、家成、玉文、志偉家	22.998866	121.127079	\N	家庭關係複雜，家裡孩子非常多，不要過問家庭狀態。媽媽年紀比較大，不太能順暢表達。家庭屬於高需求家庭。家中有養豬，並有挖土機種植小米、生薑。育秀常請假在家幫忙家中大小事務。家源去知本讀國中，原本練舉重後轉為田徑。	\N	{}
11	前村長家	22.999699	121.127359	\N	國雄村長家養了很多動物，村晚會借我們卡拉OK機、協助廣播村晚事項，村長家裡的信仰並非基督教，聊天時可避免提及。	https://drive.google.com/file/d/1iZKUcOqpp_7seY2WEE_etUnhz6_HjX2o/view?usp=drive_link	{"村晚卡拉ok機,村晚木柴"}
12	黃詩恩家	22.998051	121.128601	\N	詩恩媽媽是廚工姐姐，很擅長畫畫，家裡的龍貓、學校籃球場旁邊的壁畫就是詩恩媽媽的作品。目前已經搬遷到崁頂部落	https://drive.google.com/file/d/11bmeJ5JgUyTf7X1-fTYrJGkMbBSc4N9h/view?usp=drive_link	{}
9	邱億凱、憫情、憫瑄家	22.999666	121.127569	\N	家境相對其他小朋友家較富裕，爸爸(副會長/鄰長)支持山服的活動，會幫忙處理晚會柴火，還借兩個爐火給我們。\n他們家很久以前從彰化搬來的，爸爸以前車禍腳受傷所以走路有些一跛一跛，家裡有種小米跟洛神，也會去打獵。\n	\N	{村晚烤爐}
13	Kiuua阿嬤家	22.998964	121.12799	\N	Kiuua(美珠)奶奶定期會坐專車到慈濟醫院洗腎，由於子女都離家，可以多跟他聊天，會熱情的請學生們唱KTV。有田在加和那條路左邊靠學校蠻近的地方。兩個小孩過世了，有一個兒子是工程師，一個在桃園做鋁門窗，有媳婦是客家人，另個媳婦叫Aping(愛喝酒)。阿嬤在2024年6月過世。	https://drive.google.com/file/d/1AnJTlX-W9V8lBrJrf33JDayLkp0b07Au/view?usp=drive_link	{}
14	胡阿男牧師家	22.998152	121.128317	\N	加拿長老教會的牧師，是一位幽默風趣的長者，有子女恩惠、彥呈。女兒恩惠也對我們非常友好，曾經到牧師家玩過桌遊。	https://drive.google.com/file/d/1pbuRlXTSlDINzYJOMD5n5Io8a7VMwfyO/view?usp=drive_link	{村晚木柴}
15	江子榮長老家	22.999382	121.128022	\N	布農名Bukun，加平教會的長老，為江新武長老的親戚，非常壯。另有孫子女胡彥呈(榮恩)、胡詠傑(江維恩)、胡奕萱。	https://drive.google.com/file/d/17fqwv7Gdvnoo7T7Ily-pDxCwwEI_Evzj/view?usp=drive_link	{}
16	貓咪阿公家	22.999454	121.127638	\N	江天佑外公，阿公的布農名Dahu，漢名邱登財，阿嬤的布農名是Puni，阿公曾在外地打拼，中年之後返回故鄉，對布農文化的傳承非常重視，會和我們分享許多人生的道理，避免提到大陸相關話題。\r\n阿公有一個兒子和一個女兒，兒子在外地工作不常回家。\r\n	https://drive.google.com/file/d/1Du2OW6XBTFCTRyi4bWMf5rYjVs1lGy-C/view?usp=drive_link	{}
17	斯帖家	22.999494	121.130232	\N	父母雙亡，由親戚接回台北照顧	\N	{}
18	田興國長老家	23.000365	121.130234	\N	曾擔加拿臨時教會主人。為書香世家，兒子為加拿國小的田老師，以前也在霧鹿擔任過主任。	\N	{}
19	馬樂可家	22.999284	121.129986	\N	關山國中退休老師，目前是社區發展協會的理事長，今年55歲(18冬)開始參加老人會活動，是蠻好聊天的對象。	\N	{}
20	雨潔家	22.999027	121.130139	\N	\N	\N	{}
21	賢記商店	22.999631	121.128104	\N	加平雜貨店	\N	{}
22	佳銘家	22.999931	121.127738	\N	父母關係迥異，小心勿提。	\N	{}
23	于婕家(雜貨店)	22.999428	121.130394	\N	\N	\N	{}
24	Biung阿公家	22.999188	121.130169	\N	\N	\N	{}
25	胡志雄、以辰家	22.999386	121.129119	\N	\N	\N	{}
30	古清白大哥家	\N	\N	\N	\N	\N	\N
73	Asaku家	22.999528	121.128565	\N	\N	\N	\N
6	包振佑、振毅新家	23.001321	121.130009		振佑的媽媽目前在關山一粒麥子基金會當廚工，同時也是加樂教會的執事，振佑阿嬤則常在國小後方的田裡務農，媽媽和阿嬤都對我們非常友好。\n振佑阿嬤家位在加樂，振佑家原本的位置在牧師家附近，現在則搬到學校正後方新建成的房子。\n	https://drive.google.com/file/d/1DzykPt97ZuiNcvhsuMO-LRClo3cmRm7G/view?usp=sharing	{}
26	胡大哥家	23.000571	121.12858	\N	大哥是文建站前負責人，會薩克斯風、鋼琴等樂器	\N	{}
27	弈萱家	22.99948	121.127303	\N	\N	\N	{}
28	歐妤恩家	22.999293	121.129642	\N	\N	\N	{}
29	Malas阿姨的姐姐家	22.999231	121.128793	\N	胡秀花阿姨(Malas)，家住巒山，來加拿參加職訓班跟找姐姐，住了三個月。 Malas阿姨的姊姊是加拿國小後方第一個玉米田所有人。	\N	{}
31	HumHum(江惠美)阿嬤家	22.999107	121.129561	\N	Humhum阿嬤是Kiuua阿嬤的朋友，兒女都在桃園定居平時都是一個人住，阿嬤時常參加文建站、村晚等活動，可以多和阿嬤聊天。\r\nHumhum阿嬤的膝蓋、手臂較不方便，需要定期去馬偕醫院回診。\r	https://drive.google.com/file/d/13bzKnnNNZ1IQHBJyLBkFWOutzGbRq7Ld/view?usp=drive_link	{}
32	晨欣、晨妤、晨蓁家	23.002135	121.123889	\N	晨欣阿公曾擔任加和的鄰長，給人加拿大家長的感覺，阿公熟知加拿部落遷移史及布農傳說故事，對於部落、山服團有很深的期許，此外阿公也曾是海軍陸戰隊的一員，有很多國軍的故事可以分享。阿公最近的身體狀況不是很好，需要時常回醫院回診。\r\n晨欣阿公、晨欣阿嬤（邱春妹）平時會到加和的田裡務農，曾經種過生薑、地瓜、小米、玉米、洛神⋯⋯等，我們曾經也到他們的田裏面農訪。\r\n三姐妹平常跟阿公阿嬤還有爸爸一起住（父母離異）。但爸爸平常會出去工作晚上才回來，主要由阿公阿嬤照顧。\r	https://drive.google.com/file/d/1AWjcikz864SNjwuV-xmFQnXR26sjlFpk/view?usp=drive_link	{}
33	胡翰翔家	23.003874	121.129345	\N	家住在非加和主幹道(往加樂路上第一個岔路)，舊家在長老家隔壁隔壁。媽媽在一粒麥子基金會送愛餐、打掃教會，爸爸平常做工為主，翰翔長的胖胖的，不愛讀書，是皓均的舅公。	\N	{}
34	義群、廷睿、諾祥家	23.002181	121.123617	\N	義群阿公有重聽，家訪主要是和義群阿嬤聊天。義群阿嬤的女兒和外孫女在利稻家，但平常阿嬤不會到利稻村去，主要是她的女兒和外孫女假日會回來加拿做禮拜。義群媽媽有被台大山服帶過	\N	{}
35	胡冠宏、Umav家	23.002512	121.123743	\N	冠宏爸爸中風身體不適，母親是護理師在紅葉工作，需花許多時間照顧丈夫，因此冠宏主要由阿嬤帶。冠宏17年時從紅葉轉來。阿姨（應該是Umav的媽媽）曾被台大山服帶過。	\N	{}
36	冠宇、品云家	23.002331	121.124731	\N	20夏才搬到加和，家裡有四個小孩，冠宇和品云是老三老四。	\N	{}
37	江聰明家	23.002516	121.123324	\N	江聰明現職為海端鄉長秘書，其太太是王秋月王媽媽，為文建站的負責人、加和鄰長，夫婦都願意提供我們很多協助，	https://drive.google.com/file/d/1Dvo4zW-YrmzrAP8BvOO6DGO-A1I2Ayld/view?usp=drive_link	{}
38	王媽媽家	23.002495	121.122945	\N	邱家三姐妹再往上一點點（加和最左上方），會到天主堂禮拜，平時工作是種田，會送大學生地瓜，提早說的話可以去吃晚餐\r\n！\r\n王媽有三個兒子，大兒子在台北，二兒子跟小兒子在台東當軍人，孫女王品涵（以前叫王涵）21冬曾來參加我們的營隊。	https://drive.google.com/file/d/1Tp_VN0KS2dYFNbXaSyC4IgDOkmOfqTrn/view?usp=drive_link	{}
39	榮哥家	23.002275	121.123919	\N	晨欣的叔叔的叔公，種生薑、釋迦，有三個女兒，一個大哥在高雄。大女兒沒結婚有對象、一個女兒在台北念書、一個女兒在國泰醫院（汐止）工作，覺得跟大學生接觸很好，會講很多人生哲學故事	https://drive.google.com/file/d/1SBV93uQfueeuEBXJHAQIi2MX5V17NAkH/view?usp=drive_link	{}
40	恩賜家	23.004045	121.128294	\N	現在跟阿姨一起住，媽媽在台南，對家裡的事很保密。恩賜目前在九族文化村打工。	\N	{}
41	晏均家	23.002911	121.122992	\N	晏均曾參加過我們的高中生課輔。	https://drive.google.com/file/d/1trPrTMLp7g_oWF2y4ppQVzjqKoGUpiwf/view?usp=drive_link	{}
42	添敏、天佑家	23.002299	121.129431	\N	爸爸是前家長會長，家裡信天主教，是退伍軍人，對小孩採軍事教育，對衛生要求高。有兩任老婆，第二任老婆生添敏、天佑。\r\n添敏、天佑在20冬時轉出，在23冬時轉回來。	https://drive.google.com/file/d/1EOomDsTwhihPJrKTATbG8EfJ0d_LGPK1/view?usp=drive_link	{}
44	陳老師家	23.002256	121.12511	\N	\N	\N	{}
45	威翔家	23.002375	121.123626	\N	\N	\N	{}
46	楊長老家	23.003711	121.128278	\N	加拿教會長老，家裡養了非常多的動物。	\N	{}
47	浩宇姨婆家	23.00405	121.128226	\N	\r\n	\N	{}
48	欣宜、瀚傑、(小)瀚翔家	23.003186	121.123081	\N	欣宜母親嫁去利稻，爸爸在利稻住，是當兵的。外公有被台大山服帶過(69年)，今年65(18夏)，外公人很好平常會帶阿祖一起上老人班，外公在老人班感覺擔任重要職位，另外也擔任鄰長。\r\n欣宜阿公是鄰長。還有三個堂哥以後也以當兵為志願。	\N	{}
49	唯希、唯甯家	23.003186	121.123081	\N	剛開始都沒有遇到，在關山附近讀小學，後來又搬回來讀書，同屆都認識他們。	\N	{}
50	Vava家	23.001128	121.129051	\N	Dama vava（a k.a加拿之狼)住在俗稱糖果屋，就是前面有停聯結車的地方。（和光、巧臻有聯絡方式）。\r\n家庭成員就是一位太太與兩名兒子一名女兒，二兒子是攝影師，女兒是馬偕的護理師。\r	\N	{村晚烤爐}
52	王大哥家	23.001995	121.126788	\N	Umav家住在玉里。	\N	{}
53	詩恩外婆家	23.004119	121.127845	\N	詩恩外婆嗓門很大，非常熱情，是江子榮、江新武長老的親戚。	https://drive.google.com/file/d/1PmDT37FBRXFpwCDnZ08cKjbZc3LF58Bl/view?usp=drive_link	{}
54	黃珮瑄家	23.008353	121.130436	\N	爸爸是桃園人，在關山工商教書，小時候有被山服帶過，會和我們聊服務理念，給我們營期方向上的建議。21冬家長會長，會借我們木材。	\N	{}
55	語恩、苡潔家	23.008189	121.13073	\N	與爺爺奶奶同住。爺爺主業鋼模工程，也忙著採生薑，語恩目前就讀均一實驗中學。	\N	{}
43	雅芳家	\N	\N	\N	晨蓁家隔一條路旁邊，牆壁上有繪畫，名字的寫法待確認	\N	\N
56	胡軍、胡薰家	23.008199	121.130832	\N	阿嬤、媽媽、胡薰、胡軍同住，媽媽在醫院上班，晚上才會回家。家裡開雜貨店，阿嬤是加樂的退休長老，身體不太好，有時候會帶胡軍胡薰上台北看醫生。胡軍目前就讀關山工商，是個成熟穩重的大男生很好聊，和老老骨頭關係良好，和胡薰一樣都很喜歡台大山服。	https://drive.google.com/file/d/1bnco4h1ZUKoHBF2xg8hvJnVT3JIrYVdb/view?usp=drive_link	{}
57	聖恩、欣卉、榮恩家	23.008511	121.130733	\N	欣卉目前就讀於台北大學社工系，曾經有協助過面試。聖恩在打棒球，榮恩則就讀於專科學校。榮恩媽媽很熱情。語婕是他們的表妹。	\N	{}
58	蘿莎、奧斯丁、露德家	23.009045	121.131295	\N	爸爸是阿美族攝影師，媽媽是布農族社工。家庭有家暴議題，蘿莎阿道曾做過心理諮商；奧思汀在卑南國中打棒球。蘿莎活躍於關山的天主教會，和老骨頭的關係良好。	\N	{}
59	炫峯、其峯、其珊家	23.008777	121.131177	\N	炫峯的爸爸是五個小孩中最小的。采融是炫峯的表姊，兩家住在一起，家境不錯，家裡是生薑大戶，炫峯很喜歡火車。	\N	{}
60	哲遜、哲慶家	23.00915	121.131847	\N	奶奶種小米，曾說過可以幫忙採梅子與收小米，阿公是余金龍長老，重視教育，會盯哲慶練鋼琴，目前在加平牧師家學鋼琴（19冬）。阿公以前是很厲害的神槍手，但現在因為腳不舒服，所以現在比較少打獵。\r\n姑姑在台東馬偕醫院工作，姑丈則是退伍軍人，育有一女阿嘎米。	https://drive.google.com/file/d/1zgZDCcUeQH0FUueTo9iDe1FDZxmoC4B2/view?usp=drive_link	{}
61	宗德、芯蕾家	23.009277	121.13178	\N	爸爸在關山工作，媽媽是做雜工，阿嬤平常在蘭嶼教書，叔叔在米廠工作，家裡有養山羊。	\N	{}
62	余利亞家	23.009411	121.131709	\N	社區協會理事長;時常酒醉。平常白天待在加拿國小對面辦公室 下午回去休息 。	\N	{}
63	江小龍老師家	23.00829	121.131014	\N	木雕老師，幽默且非常好聊，媽媽是Puni阿嬤，以前是加拿國小的廚工姊姊。	https://drive.google.com/file/d/1doBrDYOw8v6YnLWZNt7i8zjRUnZjad2r/view?usp=drive_link	{}
64	金昀家	23.008817	121.131725	\N	金昀在台東讀書練習舉重，小時候曾肺積水與骨折，於花蓮就醫過。可能是單親家庭，母親在景明鄉工作。有六個哥哥姊姊，姐姐23歲在關山幼兒園當老師。奶奶與叔叔阿姨同住，奶奶中風發作，聽不太懂話了，行動不方便需要拐杖。	\N	{}
65	語婕家	23.008615	121.130832	\N	\N	\N	{}
66	皓均家	23.009304	121.130978	\N	爸爸失蹤一陣子，由叔叔照顧，姐姐曾就讀關山國中。	\N	{}
67	雜貨店	23.008899	121.130831	\N	\N	\N	{}
68	黃大哥Ula、Aping阿姨	23.008698	121.131531	\N	\N	\N	{}
69	江大姐家	\N	\N	\N	\N	\N	{}
70	王老師家	23.008496	121.130537	\N	\N	https://drive.google.com/file/d/1qzUts3wwt62F4xY3N_3dBppuK0FYaz5F/view?usp=drive_link	{}
72	振佑阿嬤家	23.008175	121.13066	\N	振佑媽媽目前在關山一粒麥子基金會當廚工，同時也是加樂教會的執事，振佑阿嬤則常在國小後方的田裡務農，媽媽和阿嬤都對我們非常友好。\n振佑阿嬤家位在加樂，振佑家原本的位置在牧師家附近，現在則搬到學校正後方新建成的房子。	https://drive.google.com/file/d/1DzykPt97ZuiNcvhsuMO-LRClo3cmRm7G/view	{農訪}
71	村長家	23.001628	121.12659	\N	\N	\N	{"農訪,防身術"}
\.


--
-- Data for Name: Record; Type: TABLE DATA; Schema: public; Owner: neondb_owner
--

COPY public."Record" ("RecordID", "Semester", "Date", "Photo", "Description", "Location", "Account") FROM stdin;
15	19S	2019-07-01	\N	#村晚建議 \n億凱阿公的朋友建議我們可以請家長出表演，也可以借木柴 	9	\N
3	20S	2020-07-01	\N	#家庭概況 \n振佑阿嬤家裡有種小米、南瓜、小麥。振佑媽媽有兩個弟弟，在台東從事水泥技師、水電外包工作，振佑媽媽則在關山工作 \n \n#孝藤同名 \n孝騰的名字，是個搬瓦斯的帥哥，又叫炸彈客。 \n \n#一粒麥子大解密 \n一粒麥子為原委會下之組織，透過為期半年的計畫申請經費，在各部落間有成立文健站，提供老人活動與學習簡單手作的機會，可考慮下個營期與文健站合作，如舉行簡單的手作教學，有利於與村中老人熟悉，加速了解村內狀況，若能邀請老人們一同出席晚會，甚至一同進行表演，會是一個很不錯的突破（此點為在新武已有成功施行案例後推薦） 	6	\N
1	19W	2019-01-01	\N	#暖 \n晚會最後振佑媽媽寫了一張卡片並送了一罐洛神花給我們，超級暖的，非常積極參與我們舉辦的活動	6	\N
7	18S	2018-07-01	\N	#悅慈初登場  \n飛倞家有三個小孩，飛倞是老大，底下有兩個妹妹，老二聽說很聰明伶俐，在幼兒園中班就讀，是老師認可的乖小孩\n \n#營期回饋 \n飛倞爸爸希望營期可以延長到兩周，也全力幫助村民活動 \n\n#飛倞媽讀大學 \n飛倞媽媽有在市區繼續念大學（人文科學），因此他對我們大學生其實也算了解（像什麼GPA、學分之類的)	7	\N
16	20W	2020-01-01	\N	#晚會功臣 \n億凱爸爸人很好，幫我們處理晚會柴火的事，也借兩個火爐給我們，他跟彥霖加賴有事可以聯絡，以後如果有需要可以先用line與他聯絡，像是村民晚會。 	9	\N
10	18S	2018-07-01	\N	本期和家人到霧鹿種番茄，因此都沒有出現	8	\N
6	18W	2018-01-01	\N	#職棒選手 \n爸爸為棒球選手，以前在南投教棒球，現在在台東體中教，飛倞要功課寫完才能去打棒球。爸爸對我們極為支持，曾邀請我們到家裡烤肉，村民活動也送一箱籃球當禮物	7	\N
17	18W	2018-01-01	\N	#小孩狀況 \n1. 愉柔臉上燙傷的傷疤需要經常回診，很堅強勇敢，遇到困難不大會放棄 \n2. 愉柔可愛、話不多，認真學習積極參與，但容易自卑被忽略，需要多鼓勵 \n3. 和晨欣很要好但要平等對待她們兩個，以互相學習鼓勵的方式帶他們	11	\N
2	19S	2019-07-01	https://drive.google.com/file/d/14IUCERYL0elmAxAVzzArbka2Dxzusopu/view?usp=drive_link	#振毅生快 \n包振毅家給芒果，包媽給蛋糕請我們跟小孩一起幫振奕慶生，包振毅的生日是100.07.13 	6	\N
72	18W	2018-01-01	\N	#阿諾初登場 #小米大哉問\n和義群阿嬤聊天，家裡有一個八個月大小嬰兒，家裡種小米地瓜，一月底已經收完，小米農會收購一公斤100多，農會收的比外面貴一點\n	34	\N
11	19W	2019-01-01	\N	#小孩狀況 \n主要由媽媽負責管志輝、志宏的事情，兩個小孩吃飯速度都很慢，志宏上課又會不專心，但是還是能回答出老師的問題。 \n \n#爸媽管教 \n志輝家，兩天分別遇到媽媽跟爸爸，小孩的是主要是媽媽管，村民活動媽媽可能會帶志輝來，爸爸去工作。(媽媽也是早上工作，下午回家就煮飯)	8	\N
73	18S	2018-07-01	\N	＃家庭概況\n1.義群阿公有重聽，因此家訪主要都是和義群阿嬤聊天，但是阿公好像都還是會在旁邊和我們一起聊天。\n2.打耳祭的小米酒主要是義群他們家在醃的。\n\n#利稻的連結\n義群阿嬤的女兒和三個外孫女在利稻家，這次剛好邦瑀和慧祐（利稻家超老骨頭）有帶過，就和義群阿嬤有聊到這件事。但是平常義群阿嬤不會到利稻村去，主要是她的女兒和外孫女假日會回來加拿做禮拜。	34	\N
74	20W	2020-01-01	\N	#村晚功臣\n義群阿嬤在家，一樣對我們很好，和他借木柴的時候就直接答應了，隔天會再去跟阿嬤拿木柴。目前廷睿在高雄，明天(1/18)會開刀，接著會休息幾天。\n\n＃廷睿開刀　\n廷睿今天(1/20)晚上六點才從高雄回來，嘴唇非常之腫，只能吃流質食物，嘴唇閉不太起來，要吃止痛藥，三十一號要回診。\n\n＃家庭概況\n義群爸媽跟一些親戚暑假會去霧鹿做農，種高麗菜、番茄，會住那邊，然後阿嬤顧小孩，冬天以打零工為主，韓唯希家的狗很兇要小心，阿諾兩歲八個月今年上幼幼班。\n	34	\N
4	23S	2023-07-01	\N	#農忙 \n學校後面的田是他們家的，現在是小米收穫的季節所以很多在燒田，有問振毅阿公阿嬤要不要幫忙種田，他們答應之後可以。 振毅射箭比賽全國第六 	6	\N
8	19S	2019-07-01	\N	#晚會功臣 \n飛倞爸爸很熱心地幫我們載烤爐，還幫我們生火	7	\N
18	19S	2019-07-01	\N	#村晚功臣  \n跟黃國雄村長借了噴燈、打火機，確定木柴跟廣播的事情 \n#家庭狀況 \n村長的大兒子在基地當飛機維修員，大女兒是愉柔的媽媽，大二就嫁給蘭嶼人，二兒子警專大四(85年次) 	11	\N
12	18W	2018-01-01	\N	#家庭狀況 \n億凱阿嬤的腳不好，田地都由阿公負責耕種，億凱爸爸則分享了他用捕獸夾抓山羌的過程 	9	\N
13	18S	2018-07-01	\N	#億凱爸趣聞 \n1. 億凱爸爸以前在花蓮讀書，三年前回來台東 \n2. 億凱爸爸會跳街舞(breaking跟popping)，但是因為幫他爸爸開車時出了意外就沒跳了 \n3. 億凱爸爸推薦大家去多認識山裡的單身女子，因為億凱阿姨就是嫁給平地人XD	9	\N
14	19W	2019-01-01	\N	#打獵  \n億凱爸爸會使用改造過的獵槍打獵，也有養獵狗抓山羌，附近有很多猴子，會烤猴腦來吃。提到家裡以前有養小豬小山羊，現在有養鴨子 \n \n#村晚建議 \n1. 億凱爸爸推薦我們村晚要烤肉，部落裡的村民對麵疙瘩、湯圓(本期晚會主食)這些平地人的食物沒有情感連結 \n2. 晚會設備需要加強，可以到旁邊雜貨店借新的設備，晚會如果有吉他會比較有fu，建議開始時間可以晚一點，如果要生火可以找他幫忙	9	\N
65	18W	2018-01-01	\N	#家庭概況\n媽媽在一粒麥子基金會負責送愛餐，早上煮飯中午開始送給獨居老人，爸爸負責修水管等工	33	\N
66	19W	2019-01-01	\N	#家庭概況\n媽媽在加樂教會清潔打掃，住在隔壁的叔叔是歐桑，還有一個伯父是鄰長\n	33	\N
75	21W	2021-01-01	\N	#四十年的羈絆\n義群到關山國中就讀了。這期得知義群的媽媽以前有被山服帶過，可以和媽媽聊以前山服的故事，媽媽很喜歡XD\n	34	\N
76	22W	2022-01-01	\N	#疫情看法 #接納\n那天我們前往廷睿家，在廷睿家我們主要是跟廷睿阿公還有一個阿嬤聊天，主要聊天所聊到的是有關在疫情下對我們的看法、還有廷睿阿公家工作的事情，而他們對於疫情似乎沒有我們所來的擔心，算是給我們蠻大的鼓勵，而他們感覺也蠻接受疫苗的，只是會擔心副作用而已所以感覺除了身體狀況不好都會去打疫苗。\n然後廷睿阿公還有廷睿爸爸有時週六都要工作，最後感覺廷睿家真的對我們很親切，廷睿媽媽煮超多東西給我們吃讓我感到非常的親切，也很謝謝他們願意接納我們。	34	\N
77	23S	2023-07-01	\N	#小米大哉問\n小米要打四次才算完成，並且現在價格很高，一台斤200元。這天收穫了兩袋地瓜和一包小米，地瓜推薦水煮或是烤，也可以切片拿去炸或煎。小米加進白米裡面一起煮，現在是小米收穫的季節所以很多在燒田。\n	34	\N
20	24W	2024-01-01	\N	#山青 \n村長的二兒子目前在關山分局服務，聊到前幾年有四十年前的老骨頭回加拿尋根，家裡還掛著老骨頭們的合照，人非常和善，之後也可以找他聊天 \n \n#村晚功臣 \n村晚臨時木柴不夠，村長又借了我們一些木柴 	11	\N
28	22S	2022-07-01	\N	#卡拉OK機死亡 \n阿嬤家卡拉ok機壞了，但還是很歡迎大家去找他一起唱歌，而且阿嬤都會記得大家的名字	13	\N
29	23W	2023-01-01	\N	#天選之人 \n提起口罩的是事情，阿嬤很高興地分享說他沒有打疫苗，而且還沒確診過 \n \n#阿嬤的姐妹淘 \n嘟米阿嬤是加拿的環衛，還有一個Danabus阿嬤住在馬勒可 \n \n#阿嬤的布農語小教室 \nMybabu(比較符合傳統的講法) babu（豬肉)  \nBani（雞翅/整隻雞） Ranun水（還是水瓶我不太確定）  \nGobu杯子 Barugan 碗 Dagu 湯匙 Hasi 筷子 Sara 盤子	13	\N
30	24W	2024-01-01	https://drive.google.com/file/d/1LONJSU-o_Vo2rOnaaLm70zXl76KLBQPw/view?usp=drive_link	#溫馨小插曲 \n阿嬤說最近身體有好一點，我們聽到很開心，也有跟東昀視訊，最後大家唱歌跳舞給阿嬤聽，維真還秀獨舞，阿嬤很開心！	13	\N
31	19W	2019-01-01	https://drive.google.com/file/d/1IwA0wziF1ofPtqdvaqhv2Sv9v3BV-nMB/view?usp=drive_link	#誰是臥底 \n教會禮拜結束後，牧師邀請我們到家裡喝茶，並和恩惠、榮恩玩了誰是臥底等桌遊，聽到榮恩說過幾天就要考學測了，我們頓時很緊張，沒想到榮恩老神在在地繼續陪我們玩XD 	14	\N
21	25W	2025-01-01	\N	#動物園 #新小孩登場 \n前村長家養了很多動物：兔子、日本雞、一般的雞、藍寶堅尼雞、狗、鳥、貓。前村長老婆說通常不會殺日本雞和藍寶堅尼雞來吃，只殺一般雞；兔子是放養，沒有圍起來所以牠們可以亂跑。村長的孫子叫做善一，國小六年級的姐姐常常回來顧他。 \n\n#Michael 身世之謎 \n前村長老婆說了Michael的故事。Michael是一個之前很愛喝酒的人，但現在身體變成有點不好，動不太了了。	11	\N
22	18W	2018-01-01	\N	#家庭背景 \n父親:鐵工；母親:廚工姐姐(胡美玲)很會畫畫；五個小孩(一男四女)：老大:新店慈濟護士；老二:志願役(台北)；老三:高三；老四:高二(冷凍科)；老么:詩恩。由長女照顧父親。	12	\N
33	22S	2022-07-01	https://drive.google.com/file/d/1wQutwoc1eT87qup0fr8BgU7ig9WyQBAO/view?usp=drive_link	#教會獻詩 \n這次在教會獻詩後，牧師說我們唱的有進步，動作也很整齊，我們有與他約當日下午去他家，但當日沒找到人。在團本巡村那天與學承一同前往，當天下雨因此牧師在家吃飯。 \n \n#牧師工作史 \n他們剛好吃完飯請我們吃水梨，而且牧師家很舒適漂亮有冷氣，我們就聊了一下這次去教會的表現啊，還有問一下好笑的問題，例如問牧師有沒有去過台北，不過剛好問到牧師的工作史，牧師之前在淡水的教會服務，當時淡水新市鎮都還沒有發展起來，之後才被調回來服務。 \n \n#布農古調 \n牧師還有教我們唱一首布農古調，之後去牧師家可以唱，歌詞在公事群，子晴有錄音。牧師還有幫家樂（家帆妹妹）取布農名，叫做Uli，跟牧師老婆的名字一樣。	14	\N
78	24W	2024-01-01	\N	#收到美味蔬菜\n 義群阿嬤說他們有種四季豆 、花椰菜，一年會採收兩次，現在是採收的時候，阿嬤也有給我們四季豆。\n  \n #教會表演建議\n 阿嬤說以後在教會可以唱「美好的祝福」\n  \n #阿諾被關心了\n 阿諾媽媽很關心小孩在學校的狀況，有跟她分享阿諾在學校唱歌\n  \n #愛情故事\n 村晚的時候和阿諾媽聊到阿諾爸媽的愛情故事，阿諾媽當時在花蓮工作，阿諾爸是同事的朋友，阿諾媽表示當初根本看不上這個人，只聽到風聲說這個人對她有好感，但沒去在意(強調她比阿諾爸大兩歲而且也比較高)，直到有一次生了場大病，辭掉工作回到台東慈濟住院，阿諾爸從花蓮殺下來，無(趁)微(人)不(之)至(危)地照顧她，最後才在一起。	34	\N
32	22W	2022-01-01	https://drive.google.com/file/d/1txNMIm9toIaHJe4ESsPUGKJSuiIR-aar/view?usp=drive_link	牧師請我們吃了超多水果，有仙桃、黃金果、鳳梨釋迦，久違地和牧 師的小孩一起聊天，得知恩惠於加拿國小放學後幫忙小朋友課輔	14	\N
24	20S	2020-07-01	\N	#近況 \n1. 詩恩媽媽近期教小朋友跳舞，準備參加比賽 \n2. 詩恩的二姊、三姊現在是稻作工人 \n3. 詩恩家曾經住在加樂（住在包振佑家對面的鐵皮屋），爸爸過世後搬到加平牧師家下面 \n4. 詩恩家有種苦茶油 	12	\N
69	23W	2023-01-01	https://drive.google.com/file/d/1yrSGV6sMOVfjKNe6V-MBDXXVSnyuDE4M/view?usp=drive_link	#塗水泥\n這天遇到翰翔的家人，他們正在火爐上塗水泥，因為平常燒火久了之後整個爐子會裂開，所以要在爐子上塗一點水泥，還要在下面安裝輪子，以便搬運。	33	\N
25	17S	2017-07-01	\N	#kiuua阿嬤初登場\n於17年射耳祭認識，聊天之後了解阿嬤平常在山下工作，佳節回來， 二十年前被山服帶大	13	\N
27	20S	2020-07-01	\N	#kiuua阿嬤初登場 \n1. 在飛倞家遇到胡美珠阿嬤坐在電動車上，他很好聊天人也很好。阿嬤二四六會去洗腎，有專車會接他到關山醫院，八月多也要去裝假牙。他認識一個利稻家的老人，他說我們的臉孔都很陌生，希望之後可以多找他聊聊。(7/25東昀紀錄) \n2. a.在學校後面遇到採芭樂的kiuua阿嬤，因此被送了4顆XD \nb.他的田在加和那條路左邊蠻前面的地方，有種芭樂、鳳梨、玉米、香蕉、生薑。 \nc.他跟利稻的好像很熟。(7/26文軒紀錄) 	13	\N
79	24S	2024-07-01	\N	#小鬼頭阿諾\n 跟阿嬤聊阿諾今天上課很乖，但阿諾穿長袖看起來很熱，阿嬤跟我們說阿諾冬天喜歡穿短袖，夏天卻穿長袖ＸＤ\n  \n #玉米\n 阿嬤說收成玉米是要餵動物的。還有聊到她在山下的農田以及山上種的小李子，因為猴子會偷吃李子，所以要靠養的狗狗趕猴子。\n \n #活到老學到老\n 阿嬤每週會參加原民會課程，像是咖啡和編織課，阿嬤感覺蠻喜歡的，笑著說「做起來比看起來難很多耶！」。	34	\N
80	25W	2025-01-01	https://drive.google.com/file/d/1yG-SFu_mA3PjAmzWwH9gWUNtW79JbkFG/view?usp=drive_link	#落地生根\n阿諾爸爸說他還沒結婚之前是在開大車的，從台東再往鶯歌，繞到高雄之後再回到台東，結婚之後就一直住在加拿村。\n\n#生日快樂\n今天是阿諾外婆的生日，她的孫子孫女們都從利稻回來慶生。\n	34	\N
42	19W	2019-01-01	\N	#貓咪阿公初登場 #家庭概況 \n飛倞家外遇到貓咪阿公，和飛倞媽媽的姐姐，兩個人很好聊，很願意分享，都有在都市生活過，阿公在台北，大姊在高雄長庚當過看護，現在都退休住加拿 \n \n#布農文化傳承 \n願意教族語，重視布農文化，希望有人傳下去，喜歡跟年輕人聊天，聽到我們會跟別人分享族語感到很開心。可以再跟他們好好聊一下。	16	\N
47	24W	2024-01-01	\N	#有機地瓜 \n阿公平訪送給大學生一些地瓜，阿公種的菜都沒有放任何農藥，連肥料都沒有放，但不給我們幫忙挖地瓜的原因有苦難言。 阿公提到他們種的農作物大多因為量不大所以賣不出去，都是自己吃或送人居多。 \n \n#好孫子天佑 \n天佑的爸爸在住院不在家，所以天佑常住在阿公阿嬤家。天佑常帶阿嬤去大潤發，在阿嬤家還會幫忙煮飯、打掃。 \n \n#阿公對台灣的展望 \n台灣沒有煤礦、鐵礦，只是做代工把東西組合並不賺錢，台灣十年後可能會變成自給自足的生活。	16	\N
81	18W	2018-01-01	\N	#家庭概況\n冠宏叔叔阿姨輩比較含蓄，阿嬤較擔心冠宏課業，但家訪時通常在煮飯	35	\N
43	20W	2019-01-01	\N	#溫馨 \n晚餐提前的那次家訪，再次走進貓咪阿公家，一群人圍在貓咪阿嬤旁邊撥樹豆，聽貓咪阿公講起Valis的由來和很多歷史故事，毛茸茸的貓咪四處走動時不時磨蹭，我們要走的時候阿公還送了我們一個餐盒給我們，一切都好溫馨愉快	16	\N
36	24S	2024-07-01	\N	#紅葉球魂到牧師熱情 \n年輕時因感動踏上牧師之路，熱愛籃球與棒球的紅葉少年，如今已在加平教會服務超過二十年。牧師熱情邀請我們參加加平教會活動，並關心我們夏令營的情況，還鼓勵我們多關注政治時事(牧師好像很喜歡聊政治哈哈哈)。	14	\N
44	22S	2022-07-01	\N	#身體狀況 \n貓咪阿公的老婆最近身體比較不好，沒辦法去文建站的活動 	16	\N
49	25W	2025-01-01	https://drive.google.com/file/d/1sUBbH418udvn5Yx8cvRieuOIUt-3FYqb/view?usp=drive_link	#自己的路要自己走 #愛與包容 \n前言：今天跟貓咪阿公聊天，他跟他的朋友在烤火 \n阿公很熱情，當我們進去發村晚傳單的時候，就趕快拉了椅子讓我們坐下，他跟我們聊了很久，跟我們講了很多人生道理，也講了一些他的經驗，但是原本跟他聊天的阿公比較害羞，聊天全程都只有坐在旁邊，有點可惜。 \n1. 阿公說自己的路要自己走，不是靠爸媽或老師，爸媽只是幫把我們的路導正，讀書讀的東西都是自己的，所以要我們好好讀書，一步一腳印、踏實的生活。 \n2. 阿公以前（民國40、50年）在台北工作，他也知道台大跟師大在哪裡，但是那時候在那裡的人都對原住民不太友善，都會講一些帶有歧視的話，像是「番仔」、「棒賽喔喔」之類的，他當下還聽不懂，是在問同事之後才知道其中的意思，他希望世界保持和平，不單單是台灣跟「對面的國家」，也希望各個地方都能夠和平生活，不要那麼混亂。 \n阿公很感性，在回憶自己過往的過程中，經常眼裡充滿淚水，他說看著我們年輕人就會，會讓他想起他從年輕撐到現在的打拼、努力過程。 \n \n前言：貓咪阿公與阿嬤正在烤火，阿嬤比較沈默都沒說什麼話，一直坐在輪椅上默默地把木柴放進去火裡，所以我們主要是在跟貓咪阿公聊天。 \n \n#景氣大好 \n貓咪阿公分享了自己之前工作的經驗，他似乎以前是在北部的工廠工作，他提到那時候很缺人，所以都有很多工作機會。 \n \n#安麗 \n在家訪的時候有一個突然的小插曲，有一個推銷的阿伯突然進來推銷棉被跟麻油，但看得出來阿公跟阿嬤都不想買，而且看起來有點小困擾。後來聽阿公講才知道那個阿伯是外地的人，在春節的時候就會特地來推銷。 \n \n#智慧獵人 \n貓咪阿公也提起了冬天比較好打獵，因為很多動物都在冬眠，有一種\n學到知識的感覺！	16	\N
48	24S	2024-07-01	https://drive.google.com/file/d/1TsfG6D2G0lDmO65Z_O01qH_iQTZqfpla/view?usp=drive_link	#阿公阿嬤的相戀故事 \n阿公說以前結婚都靠相親，他跟阿嬤也是如此。提親的時候要要帶檳榔跟酒去女方家，總共要去三次。 \n \n#Puni阿嬤的健康狀況    \nPuni阿嬤因糖尿病食指截肢，無名指與小拇指也需治療，但她樂觀堅持每天打胰島素和擦藥。 \n \n \n#Savi阿嬤的健康狀況 \n後來來了一位買地瓜的Savi阿嬤，阿嬤說她最近都要到3點才會睡著，白天就會頭暈身體不舒服，像喝醉酒。後來阿嬤去看醫生，醫生開一些營養素給阿嬤，就告訴阿嬤沒什麼問題、要多睡一點。我們詢問阿嬤為什麼不吃安眠藥，阿嬤則說他怕吃安眠藥吃習慣，會戒不掉	16	\N
50	19W	2019-01-01	\N	#家庭成員 \n他們當時在剪檳榔，小朋友很有禮貌，有國小有國中，但都讀關山市區，媽媽美國來的	21	\N
45	23W	2023-01-01	\N	#背景資訊 \n阿公的布農名Dahu，阿嬤的布農名是Puni，阿公的妹妹跟孫子住在高雄左營（23冬時4歲）。有一個兒子和一個女兒，兒子在外地工作不常回家。 \n \n#在政權交替下的族語流失  \n日治時期跟民國時期因為同化運動和國語運動的關係，阿公小時候如果在學校說族語就要掛請說狗牌地牌子，也提到各個語言都學得不完整。 \n \n#文化斷層 \n阿公提到有許多布農族的觀念都沒有傳承給年輕一代，例如飲食禁忌，或是親戚間通婚至少要相隔五代。	16	\N
51	24W	2024-01-01	https://drive.google.com/file/d/18NLun996bBiZRlw6ztTv760VVp5MLSXW/view?usp=drive_link	#胡軍的學長  \n他的興趣是騎單車，就讀關山工商冷凍控制科高三，是胡軍（園藝 科）的學長，雙方認識但不熟悉，賢孫搭公車而胡軍有人接，兩人不會一起上下學。\n\n #冷凍控制科大解密 \n曾參加台科活動但想考北科，因為北科有更符合所學的科系。這個科 主要在學大電（中央空調）、小電（家用冰箱、冷氣）。小二就開始 在賢記顧店但一直都沒有參加山服營隊，原因是其就讀的是關山國小	21	\N
37	17S	2017-07-01	\N	#熱情 \n極為好客，上教堂後喝茶時間說可以帶我們到三個部落制高點欣賞加拿。	15	\N
38	18W	2018-01-01	\N	#一日作息 \n平日白天可能上山餵養山豬，傍晚時段會回來，平時會上加拿教會 \n \n#熱情 \n對我們非常熱情，可多交流。若於打耳祭事前聯絡，可以帶我們上山打獵!!!記得要買雨鞋	15	\N
82	18S	2018-07-01	\N	#四十年的羈絆\n冠宏家也是開雜貨店的，阿姨以前也是台大山服帶過的現在還會跟一位在國外的老骨頭聯繫（她說以前營期更久還會有農訪）\n	35	\N
83	19W	2019-01-01	\N	#四十年的羈絆\n冠宏阿姨小學的時候有被台大山服帶過，畢業後山服就斷掉沒去了，以前會有兩天一夜小朋友與大學生過夜，晚上玩遊戲的行程，在營期的後半會做農訪。\n\n#家庭概況\n冠宏外公以前是當警察，冠宏爸爸中風，媽媽到紅葉照顧他爸爸，六日會回去紅葉。冠宏阿姨有個女兒(表妹)才一歲。\n\n#宗教\n家裡佛教不是信基督教。對基督有點排斥，認為教會都把孩子帶走上課，對天主印象較好\n	35	\N
39	19W	2019-01-01	\N	#家庭概況 \n長老兒子彥成明年要考學測\n星期五要去高雄做定期檢查，三個月一次，五點多出門五小時來回車程	15	\N
40	22W	2022-01-01	\N	#疫情面對 \n平常心就好，不用擔心疫情，可以借炭火，會來村晚 	15	\N
41	25W	2025-01-01	\N	#熱情的陳昕媽 \n陳昕媽媽很熱情，當我們進去宣傳村晚安、害羞詢問他們可不可以一起烤火時，他們很爽快的答應而且趕快拉了椅子，我們一起盯著火堆發呆良久，有一搭沒一搭地閒聊閒聊著近況，「暑假颱風對田地的影響」、「附近居民今天怎麼都不在家」、「三個部落的鄰長分別是誰」等等的，最後在滿屋溫暖的煙霧中結束了這次的家訪。 \n(陳昕媽媽後來還有很關心地問要不要借暖爐給我們！) 	15	\N
84	24S	2024-07-01	https://drive.google.com/file/d/1kMOmCVtg_6YxFIjANvP7a1UouQyaHpQm/view?usp=drive_link	#長期定點 \nUmav媽媽分享她以前也有被台大山服帶過，而且畢業時剛好是台大山服最後一屆。很喜歡這個營隊，所以強烈鼓勵Umav也來參加。Umav媽媽一直有在關注台大山服，也和之前很好的老師保持聯絡，之前還有參加過老師的婚禮。後來Umav媽媽拿出一件印有台大山服logo的黃色上衣，好像是之前台大山服的老師回來的時候送給她的，保存得很好 \nUmav媽媽說之前的營隊大概都有一個月，可能帶營隊兩個禮拜，後兩個禮拜大學生會幫忙農忙。之前也有觀星相關的活動，小朋友會睡在學校，大學生會守夜，跟現在的形式很不一樣。\n\n#Umav回來吧！\nUmav媽媽的老公住在玉里，因為陪媽媽的關係所以暫時搬到加拿，之後Umav不會在加拿國小念書，而是會去玉里的學校。但是我們也有說，就算不是加拿國小的小孩，之後也都還是可以來參加營隊！\n	35	\N
85	20S	2020-07-01	\N	#家庭概況 #品云初登場\n冠宇家裡有四個小孩，其中一個升小一未來可能會到加拿國小就讀，另外冠宇家對我們比較沒那麼熱情，家裡的事情盡量不要多問	36	\N
86	24W	2024-01-01	\N	#揭秘品云爸\n品云爸爸說品云以前不是在這裡上學的，是到小一才來。爸爸以前是帶人走山的，但他很早就離職了，像是他的同事，比較晚離職，現在有很多職業傷害	36	\N
54	24S	2024-07-01	\N	#工作經驗談\n古清白大哥分享曾經到台北、台中打拚過，在三重做魚丸時，凌晨兩點就要起床工作，也對萬華那一帶蠻熟悉的。在台中蓋房子時，柱子中間不會全部都是水泥，而能會放空的沙拉油桶，所以921大地震的時候倒了很多房子。\n\n#小暗號 #禮尚往來\n聊到一半時大哥說他要去看青蛙，有人好奇想要跟著去看，結果其實是大哥要去上廁所，後來大哥看我們都是用走路的，好像很辛苦，就說之後要借機車給我們，再後來徐子翔跳舞給大家看，還邀請大哥一起跳，很有人情味的互動。	30	\N
56	25W	2025-01-01	https://drive.google.com/file/d/1RrMIK7abnNnr2ZuAW6RavoCJ5HGTlNnx/view?usp=drive_link	#文建站日常\n阿嬤們說文健站每週一到週五都有課程，每天早上都會先打一小時的球，前陣子最喜歡的是槌球。另外，初一晚會的時候，阿公阿嬤們要表演APT，所以最近都在練習唱跳。文健站平時也有許多手眼協調課程和手作課程，內容豐富。\n\n#生而養女 #親戚關係\n舒瑩阿嬤生了兩男一女，大兒子結婚了住在台中、小兒子個性內向不喝酒不上卡啦ok，所以舒瑩阿嬤很為他的婚事感到著急，她的女兒則是堅決不婚，喜歡待在家看小說，因此過年舒瑩阿嬤還要煮飯(humhum阿嬤不用煮飯，都給媳婦下廚就好)。孫子是屏東大學農業相關的科系，所以阿嬤都會叫他回來幫忙拔草。而舒瑩阿嬤humhum阿嬤的嬸嬸。\n\n#要飯了兄弟們\n舒瑩阿嬤是天主堂的，有說愛餐都是一個月的某個禮拜四很晚差不多10-11點才會提供。	31	\N
58	19W	2019-07-01	\N	＃農訪\n某個假日早晨在加和那條路旁巧遇了晨欣阿嬤（春妹阿嬤）、晨欣阿祖和邱晨妤在田裡農忙，得知我們可以幫忙後，又帶著一大批大學生上來幫忙種花生，意外開啟了我們家第一次的農訪機會	32	\N
59	19S	2019-07-01	\N	#花生收成\n晨妤阿嬤在剝我們冬天種的花生，天黑再烤肉較適合，7/20會再下去種花生或地瓜，隔幾天後又有去幫阿嬤剝花生。	32	\N
87	17S	2017-07-01	\N	#江聰明\n還未確認職位(加和鄰長?)，在池上、崁頂國小進行文化教育，時常不在家。\n\n#王秋月王媽媽\n對山服很友善，常一個人自己吃飯，日後或許可以做菜帶過去跟她一起吃。老人會在星期四早上，可以去幫忙帶活動	37	\N
88	18W	2018-01-01	\N	#四十年的羈絆\n有一個哥哥，兩位都在民國68年附近給台大山服帶過，資源非常多，對我們很好願意借很多東西給我們，今年年底要參加海端鄉鄉長選舉	37	\N
60	20W	2020-01-01	https://drive.google.com/file/d/1gUZzbKnn2Z9mpKTAebWjV615iVIh5TIK/view?usp=drive_link	#IKEA工人\n加拿國小當時收到善心人士捐助，晨妤許願要一張書桌，我們就剛好到他們家組了書桌，雅湘也在晨妤家獲得布農名Savi，另外晨妤阿嬤在撥我們冬天種的花生！\n\n#身體狀況\n阿公這期因為肺腫瘤的關係到醫院開刀。\n\n#村晚建議\n阿嬤建議我們村晚如果要烤肉的話可以晚一點開始烤	32	\N
90	23W	2023-01-01	https://drive.google.com/file/d/1k7DxlvBrLAIjQMCTDT9ZRFmlneQpZD3U/view?usp=drive_link	#江聰明的聰明人生智慧\n大哥向我們描述年輕人的外流與布農族語言的流逝，但儘管是這樣，已經60歲仍意氣風發的江大哥依然保持著活到老學到老的精神，為加拿文健站的付出等等；他告訴我們，學習就該要「多聽、多看（偷聽、偷看）」然後多多運用這顆腦袋，不然讀那麼多書要幹嘛！\n	37	\N
91	24W	2024-01-01	\N	#全能住宅改造王\n大哥說他們家很多親戚住桃園，所以他們有整修了許多房子，還跟我們介紹房屋帳\n\n#進口玉米打擊本土玉米\n原本部落人很多，大家種玉米，有特定價格，但自從外國有匯入玉米，玉米價格降低（收入降低），導致部落人變少\n\n#打獵v.s. 唸書\n講到孩子教育的問題，跟傳統文化有關，小朋友可能接觸到打獵之後覺得打獵很有趣，就不想讀書。\n\n#好書推薦\n大哥推薦了幾本書《三分鐘的演講術》、《十五分鐘快樂聊天》、《史記》、《唐詩三百首》等等，大哥說我們要多讀書	37	\N
57	18S	2018-07-01	\N	#晨欣爸爸\n晨欣爸爸好像到晚上才會看到，聽他說跟晨欣媽媽離婚了，沒下雨的話半夜要去幫生薑澆水，聽他說有給台大山服的教過(但不確定，因為當時他有點醉)。\n\n#晨欣阿公 #部落發展關心\n晨欣阿公在類似衛生局工作，很有見地，常說這裡很多年輕人都不太控制飲酒抽菸。聽他說斯帖的父母就是因為肝跟口腔的疾病去世的(?))\n晨欣阿公希望我們也能和青少年(國小畢業後的孩子)多多給他們這些觀念，因為國中不像國小會有比較親近的老師幫忙去看這件事情。如果可以的話，以後在營隊要多多加強這些觀念，因為許多家都有類似的惡性循環。晨欣阿公也已經71歲高齡了，他也不確定他能再幫助宣導這個觀念多久，他希望從小就建立好這個觀念。	32	\N
61	20S	2020-07-01	\N	#農忙\n和阿嬤聊了最近農作物的種植狀況，因為近期比較熱，所以小麥會比較慢播種一點，原住民的農作物以水稻為主、小米是其次，也有種植一些蔬菜，水果幾乎不會種，阿嬤家中有洛神花、也有自己養一些鴨、雞自己吃，晨妤非常喜歡小動物，家中有兩隻小貓	32	\N
62	23S	2023-07-01	\N	#那你有爬？\n阿公年輕的時候去馬祖當兵八年，也有幫忙挖八八坑道，在馬祖的時候是海軍陸戰隊，是在最靠近中共的地方服役，每一天都戰戰兢兢地守住最前線。\n\n#阿公身體狀況變差QQ\n阿公現在的身體健康狀況每日愈下，講話也有種氣若游絲的感覺，聽他說他自己很常去醫院，但是這裡最近的醫院還是很遠，更讓人體認到醫療資源的匱乏與不平均	32	\N
92	18W	2018-01-01	\N	#王涵初登場\n第一次拜訪，家裡有小朋友讀國小幼兒園，對我們的唱歌活動很支持喜歡	38	\N
93	19W	2019-01-01	https://drive.google.com/file/d/12NqBVO7_E5dHMmEvc25sFqDScDncDgzH/view?usp=drive_link	#家庭概況\n1.王媽媽主要提到自己再婚(同居)(王媽媽第一任老公過世，現在先生的前任太太也過世)，現在的老公住在加樂，是種生薑的大戶。\n2.王媽媽是延平鄉的人，家裡的狗狗叫巧克力。\n3.另外，王媽媽有三個兒子，大兒子和二兒子是軍人，另一個在台北開牛排館。大兒子有三個小孩，兩個姊姊一個弟弟，弟弟一歲多。\n\n#大學生連結\n這次拜訪幫子崴取名叫Dahu，也很喜歡慈敏Abus，認了慈敏當乾女兒，也送了我們一罐洛神花乾。	38	\N
94	23W	2023-01-01	\N	#捕鼠貓咪\n養了兩隻貓來防老鼠，但沒有特別的名字，王媽媽都叫他們喵喵或貓咪\n\n#about種菜\n種了很多蔬菜但不會拿去賣，都是自己吃和送人。種生薑的話會種一年、休耕一年。\n	38	\N
95	19S	2019-07-01	\N	#桃園工廠\n在桃園工作15年的工廠經營不善，在這裡的老家種釋迦五年。	39	\N
23	19W	2019-01-01	\N	#家庭狀況 \n爸爸癌症狀況不樂觀，據說今年醫不好就要從台東醫院帶回家，現在由詩恩的姐姐照顧	12	\N
26	19W	2019-01-01	\N	#利稻老骨頭  \nKiuua 奶奶有跟利稻家超老骨頭慧祐通話聯絡(自從2018冬天認識後) \n\n#大學生觀感 \n提到曾有大學生在隔壁民宿酒醉報警，認為我們不飲酒非常好。 \n\n#加拿歷史 \n提到當年會上山農訪。月眉國小當年火車有經過，現今截彎取直為高架路段，也參與蘇花改等工程 \n\n#家庭狀況 \n有六個兒子四個還在，孫子在屏東科技大學讀書，大兒子碩士畢業從事建築類工作。奶奶當年17歲被逼嫁45歲外省人，而家柔(飛倞悅慈)家下面的粉紅色房子為奶奶媳婦家	13	\N
35	24W	2024-01-01	\N	#忙碌的牧師 \n最近很多活動，牧師很忙，禮拜一跟禮拜二晚上會有分享會，所以我們去的時候牧師正在準備分享會的內容，牧師說他大概會準備半天，分享的是聖經裡面的內容。 \n\n#牧師工作大揭秘part2 \n牧師跟傳道士的差異在於，牧師要考試，阿南牧師大概是30幾年前考上牧師，他說，牧師在哪個教堂是會由一個宗會決定的，牧師說他的家鄉在延平，後來被派去淡水，20幾年前來到加拿，就在這邊蓋了房子，因為覺得加拿很安全環境也很好，因為延平在山谷裡，比較不安全，水質也比較不會好。 \n牧師年輕的時候是海軍陸戰隊，他在高雄鳳山當了三年的兵，當完兵後就去讀神學院，接著考牧師。 \n \n#牧師們都是bro \n牧師常常會跟其他部落的牧師交流，像是他常常跟霧鹿或利稻的牧師一起喝茶、聊教會的事。 \n \n#牧師的愛情故事 \n牧師跟他的愛人是小學同學，之前沒有聯絡後來遇到又復聯，交往八年後結婚還生了三個小孩。 \n \n#貓咪身分公開 \n牧師家的公貓叫做老灰。 \n \n#土石流 \n加拿颱風可能會有土石流，會影響到農作物收成，如果很嚴重的話，加樂的村民需要集合到加拿國小去避難。	14	\N
46	23S	2023-07-01	\N	#about貓咪 \n貓咪不會進到阿公的家裡，阿公只會在門外喂他們，近年的貓好像有變少的趨勢 \n \n#感嘆時代變遷 \n貓咪阿公對時代風氣改變十分有感，不斷強調之前的年代比較純真，就算男女一起洗澡都沒有問題，不會有奇怪的想法或是行為，但現代人哪怕只是在路上多看人一眼，都可能被對方刀砍殺，阿公對於無故亂按喇叭的行為也十分反感。 以前壓力來源不只有學校還有家裡，考不好老師會打，回家也會被家裡的人追著打，但現在壓力來源都來自於學校	16	\N
52	23W	2023-01-01	\N	#音樂小天才 \n大哥會吹薩克斯風是因為肺不太好需要復健，大哥以前是音樂老師，主修鋼琴，晚上還會去酒店表演。 \n\n#貓咪天堂（有照片） \n大哥現在家裡有五隻貓，都是自己跑去大哥家裡面的，大哥非常熟悉每隻貓咪的特性，也非常歡迎每隻小貓來家裡（照片是黃小咪） \n\n#文健站前負責人 \n大哥是文健站的前負責人，會準備小旅行帶文健站的人出去玩，他說，當老人們退休後，有事做比沒有事做好	26	\N
63	24W	2024-01-01	\N	#阿公的身體狀況更新\n阿公眼睛不好，這邊沒有主治醫生，都要去台東的醫院看病，阿公說他昨天才剛去台東看完病，去治療白內障，但還是看不太清楚。\n阿公牙齒也不好，所以不能吃硬的東西。村晚沒辦法來，因為晚上他眼睛不太好，可能沒辦法出門，但他白天的話就會出去走走。阿公現在有高血壓，所以要吃藥，而阿公說他藥都要放在固定的地方，避免忘記。\n\n#地瓜、小米、芋頭\n他們也有種田，種地瓜，是阿嬤在顧，種田是自給自足，沒有拿去賣。小米在正常情況可以一年兩次，但有颱風會少收一次，所以很少人會種兩次，而芋頭是一年生，所以很少人喜歡種。最近天氣太冷了不去田裡工作 ，要等到過年後。\n\n#當兵談\n阿公說他是老黨員，他之前十六歲就被抓去當兵了，當了8年的兵，因為那時候台灣很多外省人，然後都沒有人想要去當兵，所以原住民就臨時被抓去前線當兵了。阿公說他們那時候是去媽祖當兵，都要坐船坐一天半，然後阿公說媽祖超冷，而且那時候當兵的物資也不好，政府很窮，給的小米都是發霉的，生活很辛苦。\n\n#愛水不怕流鼻水\n孫子都不太喜歡穿太多衣服，但天氣很冷，所以阿公都會在他們出門前叫他們穿多點。	32	\N
96	18W	2018-01-01	\N	#晏均阿伯\n養的猴子吃香蕉牛奶，阿伯友分享蛇的故事很怕被蛇咬，且阿伯有被台大山服帶過。\n	41	\N
97	25W	2025-01-01	https://drive.google.com/file/d/1YogLcjRstkxLujA_o9_VN3zvtw9-V65C/view?usp=drive_link	#基本資料\nDaubas大哥說他有兩個弟弟，三個姊姊，其中一個弟弟是村長，另一個也是住在加和。他的女兒(Mua)和孫子住在桃園觀音，只有寒暑假的時候會回來加拿。(Mua蠻年輕的看起來人很好，有機會可以跟她聊聊天。)\n\n#農事\n大哥說他有種南瓜，一年兩獲，雖然南瓜通常在夏天種，但是大哥為了賣到比較好的價格，所以挑在冬天種，除了南瓜之外，大哥還會種一些蕃薯跟小米\n\n#軍營生涯 #回歸田園\n大哥是讀軍校，他說因為當時讀軍校有政府補助，所以大部分的家庭都會送一個小孩去讀軍校，大哥當過的兵種很多，他還說到最好帶的兵是在當兵期間有進過監獄的兵，因為會比較聽話。大哥有當過鷹架工人，但是做到後來覺得太危險，所以就決定回到加拿種田，大哥家的房子很漂亮，是自己漆的。\n	41	\N
98	18W	2018-01-01	\N	#爸爸媽媽\n五點種田回來，冬天作物以收成(可能是生薑)。父親接待，母親煮飯 態度不錯。\n	42	\N
99	19W	2019-01-01	\N	#添敏爸運動家\n添敏爸爸非常好聊，從前也是讀體中的，練過田徑（跳高）、舉重、游泳，也會打棒球、足球、手球，曾被加拿國小邀請擔任足球隊教練，但添敏爸爸考量到加拿國小救護系統不是很好，無法承擔小孩子踢足球受傷的責任，就推掉了\n\n#添敏爸才藝多\n添敏爸爸還會彈吉他跟打鼓、吹口琴，他年輕時曾經在家裡彈吉他唱歌\n\n#對天佑的田徑夢\n添敏爸爸覺得天佑跑步的樣子很正確，之後長大抽高變瘦之後很適合去練田徑。	42	\N
100	19S	2019-07-01	\N	#家裡職業\n在割稻跟除雜草（副業），家後面是幫人蓋房子的（主業)	42	\N
9	24W	2024-01-01	\N	#棒球集訓 \n飛倞爸爸寒假都不在，要到除夕前幾天才會回來。因爲泰原國小棒球集訓、志輝暫住在飛倞家。 \n \n#悅慈的射箭夢 \n悅慈想去射箭體育班（國小興趣）、但飛倞爸媽覺得訓練強度不同，應該要再多思考。\n \n#家庭和睦烤肉香 \n飛倞媽媽目前在文建站擔任老師，平常吃飯可以多找飛倞媽媽（個人覺得可以多跟媽媽聊芷萍悅慈在學校的狀況、媽媽蠻關心的，及飛倞爸爸擔心媽媽孤單）。另外，平時烤肉都是由飛倞爸爸負責、所以如果飛倞爸爸不在，家裡\n就不會烤肉，但可以借木材。 飛倞爸媽年輕時在台中工作定居過，後考量家裡有長輩（飛倞奶奶），及房租帶小孩等經濟因素而決定搬回。\n飛倞爸爸非常友善，不斷的提及謝謝我們來帶小朋友，也是一直以來幫我們很多的村民，大家可以多去逛逛，找飛倞媽媽也很讚！而且烤肉超超好吃！	7	\N
19	22S	2022-07-01	\N	#村晚感謝 \n巡村感謝時去找村長，謝謝他的幫忙，就有聊到今年沒有村晚，因為疫情只上來短短幾天，冬天辦村晚時再邀請村長！ \n \n#南瓜綠豆冰 \n村長請我們吃南瓜綠豆冰，是自己用製冰袋做的，順著這個知道像是南瓜綠豆都是村長自己種的，完全純天然。 \n \n#村長家是動物園 \n旁邊有曬乾的玉米，是給村長家的豬吃的。他們家像個小型動物園，有山羌、兔子、豬、水鴨等等。村長還有跟我們介紹百步蛇的雄雌怎麼分（雄百步蛇花紋較深）。 \n \n#肥皂教學 \n村長宗教不信基督教，因此聊天時可以避免提及以免尷尬。村長太太會做肥皂，我們有問說村長能不能教我們做肥皂，村長太太同意，但表示材料需要自備，有送給我們一個玫瑰型的肥皂。 \n \n#檳榔習俗 \n在家訪過程中，村長孫女吃檳榔，我們下意識制止，但後面意識到此行為不太禮貌，村長當時回覆說他們就是因為吃檳榔才不會蛀牙，這部分可能要注意一下當地習俗。	11	\N
34	23S	2023-07-01	\N	#立足台灣，展望國際 \n牧師20幾年前去泰國傳道，那時泰國沒有燈，講道的時候要用手電筒照，會殺豬煮晚餐吸引民眾來聽。白天民眾在工作，牧師會四處走走，備稿、幫病人禱告十年前跟教會一起去安徽傳道，曾經十幾天沒有洗澡，後來去澡堂搓澡。但現在被禁止了不太能去。 還去過韓國首爾禱告山四次，在那裡學習、上課，那邊的講堂都很大，宗教很興盛。甚至還有去國寮國。\n \n#牧師的農園 \n牧師家有很多南瓜，加拿的人大多種地瓜、小米和南瓜\n\n#牧師工作大揭秘 \n牧師先去工作後考了神學院，在花蓮的神學院會學希伯來文、英文，還要練習母語，因為長老教會很注重本土文化。另外也有實習制度，一、二年級會被分配到教會實習，牧師被派到四個教會實習，都在花蓮。 \n讀了四年之後先擔任傳道，傳道四年之後可以當牧師，還要測試母語，才可以進行母語講道。講道前要查經文的原文，確定內容沒有偏離，原文是希伯來文，但牧師說他沒那麼厲害，是看翻譯好的中文版。	14	\N
53	25W	2025-01-01	\N	#走到哪跳到哪\n一開始在外面坐著聊天，子翔說他要表演一段舞蹈給阿嬤看，於是我們幫他選了早操歌「不要不要」叫他跳（我還幫他喊口號）。他跳得十分投入，阿嬤也看得十分滿足～阿嬤說他們也有早操歌，是APT，原本要找她跳舞的影片給我們看，但找了老半天找不到，所以最後沒看到 不然感覺很有趣。\n\n#阿罵怕你胖\n聊了歐妤恩、歐予凡的近況，阿嬤提到歐妤恩很胖，她媽媽都叫阿嬤盯著他少吃一點，但阿嬤每次都怕她吃不飽會餓到，所以沒盯這麼緊，感覺她媽媽的這個策略可能不太管用 \n\n#看家小能手\n之後我們進到阿嬤家裡唱卡拉OK，原本子翔說要唱擱淺給阿嬤聽，但阿嬤突然有朋友來，所以在外面跟朋友聊天，於是我們先唱了別的歌。唱了幾首後，阿嬤突然跑進來說她要去玉里一趟，叫我們看家，唱完就把門關上就好不要鎖，好酷好突然	28	\N
64	24S	2024-07-01	https://drive.google.com/file/d/1ayK4bqu6DMReXQ49eEzNy7R8Vk5tKT1a/view?usp=drive_link	#國家的干城，革命的先鋒\n晨欣阿公36年出生，52年從軍，是第五屆的原住民志願役，和晨欣阿公分享自己的入伍經驗，阿公問我的第一個問題是有沒有遇到外省人，原來是以前部隊裡非常多外省人，阿公也會學各省的口音XD\n\n#加和護欄\n聊到加和那條路兩側新建的護欄，晨欣阿公表示他也不知道那是要做什麼用的，因為加拿都沒有人會跌到水溝裡面 也會擋到從家裡看出去的視野。\n\n#背景資訊\n晨欣現在的家是加和第一戶非鐵皮屋、茅草屋的房子。晨欣阿公現在年紀大了，因此也卸下鄰長的職務～	32	\N
101	21W	2021-01-01	\N	#轉學\n添敏和天佑因為一些緣故所以道桃園念書了，但這次天佑在大姊(非添敏)的陪同還有回來過	42	\N
102	23W	2023-01-01	\N	#樹豆的小知識\n樹豆一年採收一次，分成乾的跟嫩綠色的，煮法不同，乾的要先泡水處理，雖然比較繁瑣複雜，但相較於綠的口味更佳。	43	\N
103	18W	2018-01-01	\N	#小朋友狀況\n欣宜細膩、要多鼓勵他發言，缺乏信心、常跟弟弟打架。瀚傑話很少，少跟同學互動\n	48	\N
104	19W	2019-01-01	\N	#家庭概況\n欣宜的阿公是某個長（忘記稱謂了），加和的廣播是他在控制的，裡面那條路最裡面那間房間跟旁邊斜坡上都是他們親戚家，好像和很多阿姨叔叔之類的住在一起，有很多堂兄弟姐妹\n	48	\N
55	25W	2025-01-01	https://drive.google.com/file/d/1FZuPA1Jb2jpHdwpp5j0pgrDamTEHMniG/view?usp=drive_link	#文健站日常 #八點檔迷 \nhumhum阿嬤早上7:25都會去文健站上課，有時做手工藝(串珠項鍊、手環等)，有時要交作業，跟小學生很像，也會上課時偷打瞌睡，因為通常凌晨三點就起床了，睡不著。\nhumhum阿嬤還很喜歡看八點檔看到十點然後在沙發上看到睡著，醒來的時候上廁所回來還會看到電視開著會嚇一跳，她也很喜歡看美國射擊影集、動物頻道，2月初在射箭的時候，因為手之前有打過鋼釘，會酸痛、現在膝蓋也不太好，要定期去馬偕復健。\n\n#這是可以免費聽的嗎\n安芹有說上期村晚的時候阿嬤有跟她分享她有阿公跟他求愛，其實阿嬤是有很奔放、有趣靈魂的。\n\n#Kiuua阿嬤 #兒女離家\nHumhum阿嬤跟Kiuua阿嬤是朋友，都會坐在Kiuua阿媽家外面聊天，阿嬤提到Kiuua阿嬤時也是就這樣提到，感覺阿嬤已經習慣了。\n阿嬤現在是自己一個人住，娘家在同一條路下面一點，家人跟孫子女都是過年才會從桃園回來，兒子是做工廠上班，女兒是在宅急便，而大女兒回來會住家裡，小女兒會去外面住民宿，她說在家裡他們不習慣。humhum 阿嬤還說道有時想關心、打電話給他們還會被罵，說「你又沒怎樣，為什麼要打來」，阿嬤說這幾句話時，感覺心裡是很難過的。\n\nhumhum阿嬤其實很像我的阿嬤，也是自己一個人住，也很愛在晚餐時間後就看八點檔，但我覺得惠美阿嬤是個很新潮的人，她會看新聞、美劇、還會追劇追太晚追到睡著，講話慢慢的但是是個很可愛的阿嬤。	31	\N
89	20S	2020-07-01	https://drive.google.com/file/d/1030BU4MwJ7G9HwmVC32J0sPiviTOYPVZ/view?usp=drive_link	#花圈DIY\n我們在江聰明夫婦家做花圈，花圈主要是用來做為婚禮配飾使用，近期有親戚結婚，所以在趕\n	37	\N
105	22S	2022-07-01	\N	#大哥背景\n他國小畢業後就開始工作，會做鐵工、大理石、設計房子（他自己的家與加和天主堂）、彈吉他、寫聖歌（寫了十首加拿私房天主聖歌），名言是不抽煙不吃檳榔不賭博，只是愛喝酒跟愛女人而已，略有點大男人主義，會跟你說男人要扛起養家的責任\n\n#天主堂專家\n他跟我們很詳細的介紹天主堂的設計理念與各個構造的含義分別為何，還有裡面的擺飾有些可能是自己親手打鐵工出來的，義大利原裝進口的十字架等等。反正你跟他聊房子他會很熱情的答覆你。天主堂每個月最後一個禮拜四有愛餐，我們有詢問他我們是否可以前往一同禮拜，他是答應我們，但若未來要去還是先詢問過比較合適。若要唱聖歌也可以先請教dama vava他寫的聖歌，學起來再去獻詩，避免在天主教唱基督教聖歌的問題。\n\n#大哥的Beautiful House\n他也很熱情向我們介紹他自己的家，他們家有藍寶石做的流理台，他會很自豪的介紹說，這是他為她老婆做的漂亮廚房。家裡面還有和室，他還有邀請我們說，如果有需要可以去住。\n	50	\N
106	25W	2025-01-01	\N	#基本資料\n王大哥家有王大哥跟他的兒子（簡稱王小哥）和王大哥的妻子。\n王大哥：村長的堂哥，警察退休，他覺得讀書、工作是比較繁忙的，而他目前的興趣是在做雕刻，家裡有很多他的作品（椅子、貓頭鷹木雕等等）。\n王小哥：家帆國中同學，警專畢業，目前是警察，過年剛好回家，前幾天是在幫忙五月天演唱會的警察工作，他說非常的繁忙。\n荳荳：他們家養的狗，今年兩歲，然後村長家有些狗是他的小孩！？\n	52	\N
107	25W	2025-01-01	https://drive.google.com/file/d/11M7R01Iionsfl6Rk87b4Ud7iGR2Iozot/view?usp=drive_link	和詩恩走過加和時，遠遠聽到一聲嘹亮的「黃詩恩」，詩恩的外婆騎著老人車經過，也因此帶著詩恩到詩恩外婆家家訪。\n#江家的血脈\n江大姐是江子榮長老的姐姐，她現在住在加和（靠近加樂那邊）一棟滿新的房子。大姐很開朗熱情，講話很宏亮，感覺起來滿願意和我們聊天的，被問到外婆跟長老是不是有親戚關係，大姐說「我們江家身材高大，他那麼矮，不同品種啦」(但他們其實是親戚XD)。\n\n#殺豬小撇步\n她跟我們分享她養了一群黑色的豬在加平那邊，通常早上會去文健站中午會去照顧豬。然後那些豬一隻大概一萬多塊，平常會拿去賣，但如果有人結婚也會殺豬分給三個部落慶祝。接著她分享殺豬的過程，她說殺豬是有秘訣的，如果是要保留血的就要用刀殺，不需要的就用槍，用刀殺的時候要一刀刺到豬的心臟，不然豬會亂跑，然後她也分享一些處理豬的器官的秘訣。\n(詩恩外婆請我們喝舒跑、吃零食)	53	\N
109	19S	2019-07-01	\N	#服務理念\n到蘿莎家的時候，碰巧遇到珮瑄爸爸，很好聊也很幽默也願意借我們木材，另外和珮瑄爸爸聊了一些服務的理念，他建議我們可以把國際的視野帶進來部落（促成20冬營主題）\n	54	\N
110	21W	2021-01-01	\N	#家長會長\n珮瑄爸爸這期當選家長會長，億凱爸建議我們可以和他尋求村晚的建議\n	54	\N
111	24W	2024-01-01	\N	#阿嬤的菜園\n珮瑄阿嬤說旁邊的雞舍現在沒養雞，改成種小米，用原住民傳統種法，手撒播種。送我們南瓜跟高麗菜。	54	\N
112	18W	2018-01-01	\N	#家庭概況\n奶奶身體開刀吃藥（十二指腸），出院二十天，白天在家休息\n爸爸以前在土城工作	56	\N
113	18S	2018-07-01	\N	＃雜貨店\n胡軍阿嬤也是開雜貨店的，雖然平常鐵門是拉下的但好像還是可以跟她買 (感覺阿嬤蠻喜歡我500ml的加鹽沙士只收我10塊><)by瑞瀚\n\n＃阿嬤健康\n這次有天中午有陪胡軍回家，他要帶奶奶去台東醫院複診，開刀快好了\n\n＃胡軍升學\n胡軍好像在高雄也有家，以後國中可能會去那邊就讀	56	\N
114	19W	2019-01-01	\N	#家庭概況\n阿嬤身體有許多地方不太好，會帶胡軍胡薰上台北看醫生，家裡的媳婦在海端上班，晚上會回家，胡軍以後會上關山國中。	56	\N
115	19S	2019-07-01	\N	#阿嬤健康\n跟阿嬤聊天、阿嬤身體依然沒有好轉、家裏生了四隻貓咪	56	\N
116	20S	2020-07-01	\N	#阿嬤健康\n奶奶這期住院，胡軍也都住在醫院照顧，稍微關心了奶奶的情況，胡薰媽媽說應該不嚴重。\n	56	\N
67	19S	2019-07-01	\N	#望子成龍\n翰翔家找媽媽聊翰翔在學校的情形，媽媽蠻盯翰翔作業的，然後說他國文比較不好，翰翔媽媽感覺有在顧但工作比較忙，感覺對翰翔頗有期待但也很愛他。	33	\N
68	20S	2020-07-01	\N	#瀚翔近況\n瀚翔接下來要去關山國中暑輔，每天都是整天，而目前他都在幫忙工作	33	\N
117	24W	2024-01-01	\N	#好青年胡軍\n胡軍目前高二，在製作布農族相關的專題研究，並參與布農族歌謠社，想要守護自身部落的文化。他已決定好未來升學路線（當牧師），在班上成績優異、在關山工商的舞蹈隊當歌手。也很期待大家能參與加樂聖誕節活動。\n	56	\N
118	24S	2024-07-01	\N	#不打不成器\n胡軍回憶大學夢想與小時候的淘氣事，甚至和妹妹一起拔隊輔腿毛。他感慨過去的「老骨頭」更敢兇學生，現在學生有時太溫柔，建議我們兇一點孩子才會乖。\n\n#資深老骨頭\n胡軍說到他蠻期待這次的運動會，因為蠻久沒有辦了。也有和我們聊到這次營期的主題、我們負責的工作以及我們為什麼會想來山服ＸＤ也偷偷跟我們說家長在村晚時會變得特別兇，要記得主動幫忙才不會因為拖到流程而被罵！\n\n#課業與舉重的抉擇 \n胡軍和我們分享他未來想要就讀東華大學和原住民相關的科系。胡薰則坦言兼顧課業與舉重太累，決定全力投入課業。她也分享班導調職前，同學們製作的感人感謝影片。\n\n#播放清單\n胡軍和胡薰分別喜歡聽老歌和美式嘻哈，現場rap幾句給我們聽，很酷。\n\n	56	\N
119	25W	2025-01-01	\N	#文化交流 #我的志願\n胡軍說他2月要跟學校一起去美國文化交流，會去舊金山和洛杉磯。另外，他說他會去高雄師範大學、台東大學和東華大學面試，他最想錄取的是高師大文化相關的科系。\n\n#田徑vs.會考\n胡薰說她現在還是持續在練田徑，但是國三之後因為要準備會考，可能就會減少一些練習。另外，她說高強度的田徑訓練會讓她的心臟有負擔，所以田徑練習的部分比之前少，已增加肌力訓練代替。\n\n雖然這次家訪遇到比較少村民，聊天的時間沒有很長。即便如此，在這次聊天中我認識了胡軍和胡薰，感覺到他們是很好的人，也很願意跟初來乍到的新生們聊天，非常開心。\n	56	\N
120	17S	2017-07-01	\N	#四十年的羈絆 #家庭概況\n榮恩的叔叔是山服很久前的學生，很熱忱，家住在榮恩家對面，可多聯繫(帶照片)\n哥哥聖恩因打棒球轉到卑南國小	57	\N
121	18W	2018-01-01	\N	#小孩教養\n媽媽覺得女兒用手機 不做其他事情\n\n#家庭概況\n媽媽很熱情，很會開話題，上班時間不定。外婆住在中和，已經回來第七天，去海端摘樹豆，也有種柳橙。	57	\N
122	19W	2019-01-01	\N	#布農名\n聖恩布農名是伊比，榮恩是膩虎。	57	\N
123	22S	2022-07-01	\N	#學測考生\n22夏和諺倫單獨跑上山時，在加樂教會遇到欣卉，得知欣卉現在就讀於屏北高中，也和欣卉聊了課業、遠距課輔、大學校系的規劃，了解欣卉想讀社工系，就協助與梓豪搭上線，協助學習歷程與面試。	57	\N
124	23S	2023-07-01	\N	#學測考生\n欣卉來台大面試的時候請梓豪帶路，最後欣卉錄取了台北大學社工系！超級開心的\n	57	\N
125	18W	2018-01-01	\N	#家庭概況\n爸爸這次剛好回來，有殺豬，沒錢買外面吃的東西。學校附近有田種水稻。\n	58	\N
126	19W	2019-01-01	\N	#家庭概況\n1.阿姨問說可不可以幫忙除草，媽媽在台東上班晚上才回家。\n2.家裡有家暴問題、爸爸常喝酒、對小孩及老婆有暴力傾向、但老婆是社工似乎沒有介入的空間（？待追蹤觀察）\n	58	\N
127	19S	2019-07-01	\N	#珮軒爸 #蘿莎爸\n去奧思丁家遇到他爸爸（攝影師）跟一名導演劉蓮笙還有珮瑄爸爸（關山高中體育老師），奧爸分享了一些工作上有趣的內容、導演則分享他的服務經驗、我們也有介紹自己聊了一下科系上的事，之後則跟珮爸聊了一些理念\n	58	\N
128	21W	2021-01-01	\N	#家庭概況\n蘿莎讀國中之後，蘿莎家就搬到關山居住了，雖然露德還在這裡上學，但爸爸媽媽會下課會把他接到關山。\n	58	\N
130	23S	2023-07-01	\N	#蘿莎阿嬤的兒子女兒\n阿嬤說她的兒子以前小時候有打過棒球，但打得不是很好，現在在海巡署岸巡隊工作，喜歡釣魚，今天去海邊找他的女朋友，女朋友是排灣族的（阿嬤說排灣族的很黑）。\n接著聊到他的女兒最近生小孩還有養一隻摺耳貓，小孩1歲了，女兒34歲，阿嬤54歲，阿嬤的老公就是住在他們家附近然後看得順眼就結婚了，然後老公住在外面（公家宿舍），因為覺得山上喝酒唱歌等的很吵。\n	58	\N
131	24W	2024-01-01	\N	#美味藤心\n有一個阿北在砍樹藤，跟我們說藤心鹹鹹的可以吃。\n	58	\N
132	24W	2024-01-01	\N	（家訪炫峯阿伯，排行老三）\n#漂亮露營地\n大哥是住在台東的，因為假日有空所以回來休息，大哥他們家裝飾的很像露營地一樣，很漂亮，感覺很舒適，他們說他們有空就會回來休息或是烤肉\n\n#大哥山服談\n大哥講話很幽默，大哥說他之前也給台大山服的人帶過，所以他很了解我們山服的很多事情，也跟我們分享了很多很久之前的事情（黃色的歌本等等）\n\n#大哥遊台大\n大哥之前也住在台北大概20幾年，他說他也有去過台大，是不小心迷路到台大的，大哥說台大校園太大了，進去的時候又迷路了。\n\n	59	\N
133	25W	2025-01-01	\N	#長大的炫峯\n其峯媽媽說炫峯現在讀國中，剃平頭，每個禮拜五會回家，每天也會打電話報備，因為住校的關係感覺有變得更獨立成熟。\n\n#長髮男之夢 #好朋友髮型\n其峯也想要像哥哥一樣留長髮、燙捲，但其峯媽媽覺得他不太適合那樣的髮型，因為他的頭比較有稜有角，不像哥哥一樣是圓的。其峯媽媽說其珊和方婷、阿嘎米還有劭恩是好朋友，一起剪了好朋友髮型。\n\n#小江 #發火箭\n得知其峯其珊會拍抖音影片，也偷看到了他們拍的影片，但其珊很害羞的一直要把手機搶走\n\n#這裡有五隻超可愛的狗勾\n其峯家的狗變得很大隻，去年夏天其珊還可以一手牽著五隻小狗，現在其珊已經沒辦法牽住牠們任何一隻。五隻都被關在籠子裡，只要一有外人經過就會兇猛的狂吠。狗狗們有混到比特犬的血統，其峯媽媽說牠們還會再變得更大隻\n\n#撥豆子\n三名新生(育丞、思慧、佳怡)也有幫其峯的爺爺撥豆子\n	59	\N
134	18W	2018-01-01	\N	#農忙\n奶奶在山上種小米，一月底種六月收，農會會收，保證價格。表哥在加樂路口有養羊\n\n#家庭概況\n奶奶去台東看病（感冒）裝節律器，姑婆住關山常上來玩\n奶奶覺得哲慶、哲遜很皮，阿伯小阿姨煮的飯都不吃\n	60	\N
135	19W	2019-01-01	\N	#家庭概況\n哲慶家裡有一個5個月大的表妹（姑姑的女兒），二伯、姑姑、爸爸、阿公、阿嬤。\n\n#哲慶阿嬤\n阿嬤說採梅子、採收小米的時候可以來幫忙，阿嬤身體狀況還好。\n#哲慶阿公　＃音樂世家\n哲慶二伯（余信安）是鄰長，哲慶阿公叫做余金龍長老，阿公很重視教育，都會盯哲慶練鋼琴，哲慶的鋼琴則是他姑姑教他的，現在則在家平的牧師家學鋼琴，練了兩個月左右，哲遜當時則是去二伯家工作，長老的兒子有在學爵士鼓，以後想要在村子中教小朋友。\n\n＃哲慶姑姑 #阿嘎米\n他們的姑姑是台東馬偕的護理師，最近生了一個一個月大的女孩子（這點不確定by家帆），布農名叫做gummy（阿嘎米），很可愛很愛跳來跳去\n	60	\N
136	19S	2019-07-01	\N	#有妹妹的哥哥像個寶\n阿嬤最近也在種小米。哲慶有一個不到一歲的妹妹叫agami，超可愛不怕生很愛抱抱、哲慶是妹控>< \n	60	\N
137	20W	2020-01-01	https://drive.google.com/file/d/1NqzoD_4l0seT9oWQkKnaMP-IMw6Pe2cT/view?usp=drive_link	＃退伍殺豬\n1/17去哲慶家，遇到哲慶大姑，她告訴我們，飛倞二伯18號在加平有慶祝退休（國軍退伍），有殺豬活動，我們可以一起參加。\n\n＃醫療\n哲慶腳踢到摩托車，右腳受傷去醫院。哲慶阿嬤腳也順便去看醫生（應該是糖尿病），天氣濕冷會不舒服。哲慶姑姑在馬偕醫院工作。阿嘎米一歲，會走路了。\n （殺豬活動畫面）\n	60	\N
138	23S	2023-07-01	\N	#阿公阿嬤的身體狀況\n阿公最近因為跌倒開刀， 好了之後行動還是很不方便，所以走路需要倚拐杖，而阿嬤則是現在每兩天要洗腎一次。但是阿嬤的大兒子最近退役了，所以可以過來照看阿公阿嬤跟煮飯給他們。\n\n#愛的蔬菜和料理\n阿嬤雖然兒子叫他們不要去山上種菜，但阿嬤還是會去，所以他的女兒可以回來拿，有胡瓜跟南瓜… 阿嬤也有送我們三顆南瓜，還教我們南瓜雞（豬）肉湯怎麼煮，阿嬤說肉要先煮過加水調味，然後就可以下南瓜煮到南瓜軟就可以了。\n\n#阿嬤和阿公的婚姻故事\n因為阿嬤跟我們分享他們結婚四十週年的照片，所以談到阿嬤結婚的故事。阿嬤說以前是父母決定接回對象，所以他結婚的時候，是他父親母親在他上山放完牛的時候，突然就告知他要結婚，他的婚禮就在只有殺豬、一些飯菜以及雨鞋中舉辦，之後就被直接帶回男方家中。 \n婚後隔天，阿嬤因為太想家，所以想要回在加平的家，但是因為以前路上雜草叢生而且很高，所以阿嬤找不到回家的路，所以那幾天阿嬤都把自己關在房間裡面不出來，還好有阿公的妹妹在裡面陪著不習慣的他聊天，過了不久阿公也有帶著阿嬤回加平娘家。\n\n	60	\N
139	18W	2018-01-01	\N	#家庭概況 #芯蕾浩宇初登場\n宗德有五個姐姐，姊姊有三個小孩，一個兩歲（男生）兩個幼稚園（中班女生小班男生）。\n阿公與叔叔住，阿公蠻有想法希望小孩安全與孝順。\n	61	\N
140	19W	2019-01-01	\N	#家庭概況\n爸爸在關山工作，媽媽在剪檳榔葉賺外快。\n\n#錯綜複雜的親戚關係\n家裡還有兩個男孩（浩宇、浩軒）與一個女孩，要叫宗德舅舅，媽媽的弟弟是詩恩的爸爸（喉癌末期），家裡有養山羊。\n	61	\N
141	20W	2020-01-01	\N	#工作狀況\n宗德的阿嬤平常在蘭嶼教書，最近跑回來加拿玩，宗德的媽媽最近則是在慈濟醫院做清潔相關的工作，早上5.30就要出門。一說宗德媽媽在關山開店，9點多才會回家。\n	61	\N
142	23W	2023-01-01	https://drive.google.com/file/d/1TkRaXKvhc8La25v99Bmktv9RKXNShoOY/view?usp=drive_link	#不能被聽到的槍聲\n宗德叔叔在米廠工作，平常會上山打獵吃東西，例如飛鼠、山羌、穿山甲等，不過如果打獵的槍聲被聽到的話會有麻煩，因為聽到槍聲的人可能會去告狀。\n	61	\N
143	24S	2024-07-01	\N	#學無止境\n浩宇阿嬤在編織東西，說是在文健站上課學的，她有展示已經編好的束口袋給我們看，她說接下來在文健站的課程是泡咖啡，而且文健站的課程都蠻密集的，一到五的整天都要上。\n\n#部落青年\n遇到兩個高中生，一男一女，女生是布農族男生不是，都在工東高工學裝潢、木工之類的，家裡也有擺放許多男生自己做的小物。男生跟我們分享了很多木頭的種類，只要拿起來看一下就可以馬上判斷是哪種木頭。\n他們通常都比較晚才回加拿，所以好像沒有見過我們，而女生比較靦腆害羞，所以也不常參加集會活動。\n	61	\N
144	19W	2019-01-01	\N	#不能說的秘密\n長老今年68歲，Cina Valis 58歲。\n\n#長老兒子才藝多\n第一天上山前往長老家拜訪，村落重要人物在討論宗親會事情，由長老兒子和我們分享，以前開鼎東受限多，才藝廣泛且認識眾多原住民歌手，如A lin ，目前在加樂教會教導孩童樂器與音樂。\n	5	\N
145	19S	2019-07-01	\N	#長老挺楚瑜\n找長老聊政治，挺宋楚瑜，因為農民政策\n	5	\N
146	23S	2023-07-01	\N	#長老兒子愛打籃球\n小valis跟他爸爸一起回來，爸爸早上去比海端鄉35歲以上的籃球比賽，可惜沒有贏\n\n#狗狗葬禮\n長老家的一隻狗昨天死掉了（好像是紅紅QQ），因為流產而吐，然後小valis和爸爸把她埋在加樂教會附近的山路邊，上面還有十字架。\n	5	\N
157	25S	2025-07-01	https://drive.google.com/file/d/1mukw1WinQsgG-HM9rYzyWmkkwKK1SHfC/view?usp=sharing	"#槌球活動\n帶江琋到天主教堂找在打槌球的阿嬤（王媽媽），廚房阿姨（詩恩媽媽）和一位９３歲的阿嬤也在那邊打，並向我們解釋槌球的規則。\n歐妤恩阿嬤也在那邊打球，她說平常除了到文建站上課外最喜歡來打槌球。\n""#槌球活動\n帶江琋到天主教堂找在打槌球的阿嬤（王媽媽），廚房阿姨（詩恩媽媽）和一位９３歲的阿嬤也在那邊打，並向我們解釋槌球的規則。\n歐妤恩阿嬤也在那邊打球，她說平常除了到文建站上課外最喜歡來打槌球。\n"	3	\N
71	17S	2017-07-01	\N	#家庭概況\n義群父母都在霧鹿工作，有親戚住在利稻	34	\N
108	17S	2017-07-01	\N	#服務理念\n珮瑄爸爸為桃園人，碩士畢業是老師，曾在台北教書逾十年，後來回關山工商教書十二年，小時候也曾受過山服教育，對於我們的到來目的感到疑惑，希望我們能帶給小朋友都市的不同生活，與國際和都市接軌，而不只有歡樂	54	\N
129	23W	2023-01-01	\N	#神奇貓咪\n路德家有養兩隻白貓，據說是異色瞳\n	58	\N
70	24W	2024-01-01	\N	#加樂瀑布\n村晚宣傳遇到翰翔爸爸，翰翔爸爸正在將兩個廢棄的熱水器改造成鍋子，鍋子下面還附帶輪子方便移動。翰翔爸爸提到加樂瀑布的水近年來愈來愈少，以前比較多人去那邊玩水、抓螃蟹，自己曾經還在那而電魚過\n	33	\N
147	24W	2024-01-01	\N	#法庭翻譯第一名\n長老在法庭從事翻譯工作，以前車馬費較少。雖然海端有五個翻譯，但長老是其中翻譯最好的一個。他在進行翻譯時不會加入自身觀點，也不會收勝訴時獲得的分紅，而是把這些費用使用在加拿的事務。\n\n#我會牢牢記住你的臉\n長老提到幾位老骨頭，而老骨頭在禮拜三會上山，長老很期待見到熟悉的面孔。\n	5	\N
148	22S	2022-07-01	\N	#Puni阿嬤\npuni阿嬤是以前加拿國小的廚工姐姐，現在就是種水稻，田就是學校旁邊那個水稻田，提及此時，阿嬤還給了我們一包新米，我們有答應她下一次會回去跟他說，我們吃這包米的心得。\n\n#阿嬤的優秀孩子們\n她以前生養了很多小孩，還差點被帶去結扎，很辛苦，但現在小孩都頗有成就，有在銀行工作的，有讀醫的，最後一個女兒是遺腹子（主動提及）。過年時小孩們都會回來圍爐，那個時候會很多人，她常常會叫錯小孩的名字，阿已經是曾祖了，但真的看起來還是很年輕。\n\n#珮婷嘴真甜\n我們去的時候有問過能不能去幫忙農作，但他怕我們腳弄髒婉拒，不過感覺還是可以多聊聊！阿嬤感覺喜歡愛講話的人，因為我跟他說我叫nabas，他跟我說跟他的三女兒一樣，都嘴巴很甜Xd\n	63	\N
149	19W	2019-01-01	\N	#金昀阿姨的家庭概況\n金昀阿姨有四個兒子，他們家是軍人家庭，她的丈夫跟三個兒子都是海軍，丈夫好像已經過世了，大兒子非常貼心，都會叫她不用工作了，讓兒子們照顧她。\n\n#笨蛋小猴子\n阿姨家有養一隻小猴子，名字是布農語的小笨蛋的意思。\n\n#放棄舉重?\n阿姨有提到金昀目前在練舉重，但是因為太累有考慮不練了。\n	64	\N
150	23W	2023-01-01	\N	#小米大餐\n語婕家分享小米給我們吃，也跟我們分享他們平常都會用小米配肥肉跟小魚乾，並且建議我們可以在煮飯時加沙拉油。\n	65	\N
151	18W	2018-01-01	\N	#叔叔的小寵物\n叔叔剛從部隊回來，養兔子小雞。\n	66	\N
152	23S	2023-07-01	\N	#大哥的故事\n以前住蘆洲，做了25年捷運工人，項目有桃園環狀機捷、板南線，之後到宜蘭養雞場，鐵皮屋有大哥的家到加樂橋那麼長，機器飼養自動倒飼料不用人力，養得太密集死了100隻，環境不好、受不了雞屎味，大哥做了一年就不做了，回到台東後就打打零工\n\n#雙胞胎怎麼取布農名？\n和我們介紹起名字，大哥說長孫用爺爺的名字，其他孫子就會用爺爺手足來命名，雙胞胎名字就會一模一樣 問道村裡有沒有雙胞胎的例子時，大哥回答 Aping阿姨就是兩女一男的三胞胎）\n\n#可愛小狗\n家裡養了四隻狗（兩大兩小），小隻的超親人，遺傳自媽媽的藍色眼睛超漂亮。小隻的是因為Aping阿姨的弟弟生病才接過來養\n\n#大哥以前是山道猴子\n以前山路沒那麼方便的時候，大哥都騎機車橫越山巔到台中（天池/豐原）玩\n	68	\N
153	24S	2024-07-01	\N	#綠手指  #愛狗人士\n大姐分享在花園有種四季豆、山上則種梅子和苦茶子，種梅子蠻辛苦的，因為梅子的毛會癢。家外的籬笆也是大姐自己削尖的，非常厲害。\n大姐家養了4隻乖到爆炸的狗狗，她對狗狗的歲數計算蠻有興趣的。大姐不會去文健站、村晚等等，平常的休閒娛樂是偶爾去朋友家聊天\n	69	\N
154	25W	2025-01-01	https://drive.google.com/file/d/1l4cg7JJmhIFNMTZPh2EN8M4IuQo8Qfra/view?usp=drive_link	#基本資料\n王老師的先生江大哥13歲的時候在台南當童工，19歲時代表中華民國到菲律賓當健美國手，後來受邀當演員（特寫肌肉不拍臉的那種替身演員）跟許多過去的當紅大咖藝人合作過，出社會從事開大卡車的工作。\n\n#緣分來了要抓緊 #love story\n江大哥的老婆王老師，是高雄樹仁醫專的學生，他們在某國術館認識，不過中間斷聯2年。後來大哥路過過去的那間國術館，去敲看看當初的那扇門，應門的依舊是王老師，他們又開始聯絡，再後來就結婚了。江大哥似乎一直提醒著「緣分很珍貴也可能很薄弱，所以緣分來了就要好好把握著。」\n王老師推拿館是由江大哥重漆的，然後王老師很喜歡藝術，所以牆上許多美麗的畫都是由王老師自己創作的。\n\n#音效很多\n江大哥曾經在送貨的時候出車禍，頭被縫了五針，雖然江大哥的描述是誇張搞笑的，但可以聽得出來是非常嚴重的車禍。最印象深刻的是，江大哥說雖然出車禍了，但就把這段時間當作可以好好休息的時間。江大哥讓我看見在遇到不好的事情裡，依舊能夠選擇樂觀面對的積極態度。\n\n#祖孫情 #人生導師\n江大哥說到自己是奶奶撫養長大的，在奶奶過世的時候，他的心裡有種說不出來悶悶的非常難受的感覺。所以他很溫暖的勉勵著我們，如果遇到了什麼事情都會過去的，如果想哭那就盡情地大哭，讓體內的「那些東西」都釋放出來，就會好起來的！如果心情不好，可以到加拿大喊大叫也沒關係…他還給我們電話，告訴我們如果心情不好可以打電話給他，他很願意幫忙我們指點迷津。\n最後，江大哥約我們一起在夏天的營期到他家的庭院舉辦烤肉活動，也說可以教我們泡茶。\n\n這次家訪只有訪到江大哥，但是得到了滿滿的感動與溫暖。江大哥非常可愛又有趣，總是樂觀積極的面對生活，他已經58歲了，但一點也看不出來，因為他有著最年輕的心。記得江大哥有說家裡有糖尿病史，身體可能不是那麼健康，在講到如果心情不好可以打給他的時候，他還說不知道會不會哪天就走了，我覺得真的很難過，也很想珍惜與江大哥的緣分，在25冬的最後一次家訪能訪到江大哥真的覺得很幸運很幸福，江大哥成為了我一定會再回加拿的理由。\n	70	\N
155	25S	2025-07-01	\N	"#警察生活\n大哥提到他以前是警察並且分享了很多他當警察的故事。故事一：他開過兩次槍，第一次是在追捕毒販時往他的車輪開槍並成功射中；第二槍是追捕山老鼠的時候。還有大哥當警察當了三十二年，其中待過台北、高雄、宜蘭等據點，其中大哥最喜歡宜蘭，因為最像他的家鄉台東。\n\n#打獵\n大哥分享他的標本都是他打獵打到的，他大部分都去後山打獵，包括山羌、水鹿、山豬等等。大哥有邀請我們之後可以和他一起打獵一起烤肉，然後教我們如何開槍。\n\n#退休生活\n大哥從警察退休已經四年了，最近除了擔任村長一職也有在種田，他種了很多水果像是南瓜荔枝等等……大哥覺得他現在的生活非常充實，不但要常常參加部落的活動也要去顧他的田。\n""#警察生活\n大哥提到他以前是警察並且分享了很多他當警察的故事。故事一：他開過兩次槍，第一次是在追捕毒販時往他的車輪開槍並成功射中；第二槍是追捕山老鼠的時候。還有大哥當警察當了三十二年，其中待過台北、高雄、宜蘭等據點，其中大哥最喜歡宜蘭，因為最像他的家鄉台東。\n\n#打獵\n大哥分享他的標本都是他打獵打到的，他大部分都去後山打獵，包括山羌、水鹿、山豬等等。大哥有邀請我們之後可以和他一起打獵一起烤肉，然後教我們如何開槍。\n\n#退休生活\n大哥從警察退休已經四年了，最近除了擔任村長一職也有在種田，他種了很多水果像是南瓜荔枝等等……大哥覺得他現在的生活非常充實，不但要常常參加部落的活動也要去顧他的田。\n"	71	\N
156	25S	2025-07-01	\N	"7號走上去加和的時候，發現沒有人在家，於是我們用原本留下的line聯絡過去，才發現現在這隻帳號（電話）已經變成是孫女王品涵（王涵）在使用。王涵告訴我們王媽媽已經過世了。\n\n8號早上拜訪晨欣阿嬤的時候，阿嬤跟我們說他們是親家（晨欣阿嬤女兒嫁過去王媽媽家），應該是24年4月的時候過世，突然生病症狀很嚴重進ICU後就過世了。\n""7號走上去加和的時候，發現沒有人在家，於是我們用原本留下的line聯絡過去，才發現現在這隻帳號（電話）已經變成是孫女王品涵（王涵）在使用。王涵告訴我們王媽媽已經過世了。\n\n8號早上拜訪晨欣阿嬤的時候，阿嬤跟我們說他們是親家（晨欣阿嬤女兒嫁過去王媽媽家），應該是24年4月的時候過世，突然生病症狀很嚴重進ICU後就過世了。\n"	38	\N
166	25S	2025-07-01	https://drive.google.com/file/d/139aRH4pc2AucSNULaAQeKD3wSCrru8ec/view?usp=sharing	#前言\n坐在櫃檯的是老先生的兒子，家裡似乎還有一個國中的女兒，他說他寒假有去營隊，以及一個小女孩。\n\n#開心農場\n原本有100隻雞，很多被偷或生病死掉，知道偷的人是誰，但是沒有證據。不裝攝影機是因為雞老了，可以吃但是不太會生蛋了，之後就不再養了。老先生還是帶我們去看壯觀數量的雞，有一隻黑白的大狗兇得很，要拉住才不會衝向我們。""#前言\n坐在櫃檯的是老先生的兒子，家裡似乎還有一個國中的女兒，他說他寒假有去營隊，以及一個小女孩。\n\n#開心農場\n原本有100隻雞，很多被偷或生病死掉，知道偷的人是誰，但是沒有證據。不裝攝影機是因為雞老了，可以吃但是不太會生蛋了，之後就不再養了。老先生還是帶我們去看壯觀數量的雞，有一隻黑白的大狗兇得很，要拉住才不會衝向我們。"	21	\N
158	25S	2025-07-01	https://drive.google.com/file/d/14sKQXSRygIJu8xG2EVTP3RBlGGDh8YUc/view?usp=sharing	前言：\n晨欣阿公上期的身體狀況非常不好，講沒幾句話就非常喘，幾乎不能走路，但仍然很勉強地跟我們說了一點點的故事，射耳祭再回來也沒有看到人，山下時非常擔心這次會不會就看不到了…沒想到今天居然就看到晨欣阿公一如既往地坐在家門外。\n\n#阿公的身體狀況\n阿公上期（25冬）結束後，就因為肺、脊椎的問題到台東馬偕住院了三個月（3～5月），現在仍帶著鼻胃管，只能喝桂格、安培等流質營養品，說很想念吃肉的感覺，但比起上期健康狀況明顯好上非常多，也跟阿公分享看到阿公還可以跟我們講話覺得非常開心，阿公也笑著回應我。\n\n#部隊生活\n阿公在部隊的時候，非常盛行橄欖球運動，阿公年輕時腳程很快，100公尺只要11秒鐘，因此在橄欖球比賽時常負責達陣的工作，但也因此膝蓋兩腳都曾經開刀過。\n\n#美麗的誤會\n阿公左手臂上有類似「忠」字的刺青，我們原以為會跟部隊中的故事有關，結果阿公說只是年輕時好玩自己亂刺的。\n\n#都市的工作\n阿公退伍之後輾轉在桃園、新竹工作，原本在桃園的公司倒閉，公司轉移到中國大陸，因此在朋友的介紹下到新竹的鑄鐵廠工作，一住就是11年，春妹阿嬤也一起帶著孩子到新竹居住，退休後才回到加拿。\n\n#農忙\n關心起近期的颱風，阿公說其實雨只有一陣一陣的，對作物並無太大影響，目前正在採收地瓜，我們順勢問了春妹阿嬤需不需要幫忙，便跟阿嬤約了明天早上的拔地瓜行程xd。\n阿嬤說最近天氣好的時候會到霧鹿幫忙祈恩、祈樂（霧鹿小孩）家採收番茄，早上五點多去，下午三四點回來，義群的媽媽也有在那邊工作（前幾天在霧鹿有遇到很像他的人，果然是！）	32	\N
160	25S	2025-07-01	\N	"#資深老骨頭\n一開始遇到胡軍阿嬤，阿嬤幫我們請胡軍出來，我們先自我介紹了自己的科系、幾年級，接著就聊到很多老骨頭，像是日本人、在瑞士結婚的、姓陳土木系的老骨頭們。\n\n#準大一胡軍\n之後我們問到最近胡軍在做什麼，他說暑假蠻有空，可以來國小幫忙教族語，還談到以前會有戶外課（尋寶）來他家買東西，最後我們一起表演村晚要表演的舞蹈、唱歌，最後唱完布農歌就回去了\n\n#牧師\n胡軍解釋成為牧師要到神學院讀書。""#資深老骨頭\n一開始遇到胡軍阿嬤，阿嬤幫我們請胡軍出來，我們先自我介紹了自己的科系、幾年級，接著就聊到很多老骨頭，像是日本人、在瑞士結婚的、姓陳土木系的老骨頭們。\n\n#準大一胡軍\n之後我們問到最近胡軍在做什麼，他說暑假蠻有空，可以來國小幫忙教族語，還談到以前會有戶外課（尋寶）來他家買東西，最後我們一起表演村晚要表演的舞蹈、唱歌，最後唱完布農歌就回去了\n\n#牧師\n胡軍解釋成為牧師要到神學院讀書。"	56	\N
159	25S	2025-07-01	https://drive.google.com/file/d/1UU_olMqKvq7k266p1qeqebnbuNugRQQd/view?usp=sharing	"#19冬的回憶\n晨蓁阿嬤(Ibu阿嬤)還記得我們以前大學生有去他們的田裡幫忙農訪採花生；這次營期開始的時候他才剛把花生採收完，所以沒有機會讓我們參與。\n\n#地瓜\n阿嬤的地瓜田在加和-加平路上，這幾天下雨土壤泥濘不好挖，打算接下來幾天再去找阿嬤看需不需要幫忙；通常會在早一點還沒有那麼熱的時候做工作。地瓜種的是栗子地瓜，也有紫肉、紅肉的；採收後通常都是附近村民看誰要拿就來跟阿嬤拿。\n\n#都市的工作\nIbu阿嬤以前跟阿公有去新竹北埔、義民廟附近的積木玩具工廠工作大約 7-8 年。\n\n\n#生活記趣\nIbu阿嬤說她不敢坐飛機，所以沒有出過國；但是有坐船去綠島，不會覺得暈另外Ibu阿嬤左手上的手錶已經戴了 10 年，當初是在桃園的夜市買的一只 500 元，雖然有壞過幾次但都還是可以用。\n\n#親戚關係破解！\n晨蓁家右側平房是阿嬤的阿伯家，有一個邱大哥會跟大家聊天，他的女兒在汐止的醫院當護理師；邱大哥時常呈現不清醒狀態，早上起來村子走一圈就醉了，但還是會熱情跟大學生搭話，跟大家說要好好讀書、「好好成長」！\n\n#晨欣離鄉背井\n阿嬤說晨欣高中去淡水讀馬偕護專，是他第一次離家，阿嬤很擔心。""#19冬的回憶\n晨蓁阿嬤(Ibu阿嬤)還記得我們以前大學生有去他們的田裡幫忙農訪採花生；這次營期開始的時候他才剛把花生採收完，所以沒有機會讓我們參與。\n\n#地瓜\n阿嬤的地瓜田在加和-加平路上，這幾天下雨土壤泥濘不好挖，打算接下來幾天再去找阿嬤看需不需要幫忙；通常會在早一點還沒有那麼熱的時候做工作。地瓜種的是栗子地瓜，也有紫肉、紅肉的；採收後通常都是附近村民看誰要拿就來跟阿嬤拿。\n\n#都市的工作\nIbu阿嬤以前跟阿公有去新竹北埔、義民廟附近的積木玩具工廠工作大約 7-8 年。\n\n\n#生活記趣\nIbu阿嬤說她不敢坐飛機，所以沒有出過國；但是有坐船去綠島，不會覺得暈另外Ibu阿嬤左手上的手錶已經戴了 10 年，當初是在桃園的夜市買的一只 500 元，雖然有壞過幾次但都還是可以用。\n\n#親戚關係破解！\n晨蓁家右側平房是阿嬤的阿伯家，有一個邱大哥會跟大家聊天，他的女兒在汐止的醫院當護理師；邱大哥時常呈現不清醒狀態，早上起來村子走一圈就醉了，但還是會熱情跟大學生搭話，跟大家說要好好讀書、「好好成長」！\n\n#晨欣離鄉背井\n阿嬤說晨欣高中去淡水讀馬偕護專，是他第一次離家，阿嬤很擔心。"	32	\N
161	25S	2025-07-01	https://drive.google.com/file/d/16tXY2aCVlnVD3YO4rQeTAFEpig7cXCB3/view?usp=sharing	#背景資訊\n跟其峯、其珊媽媽聊天，他說還有一個姐姐在義守大學讀書，只有休假才會回來，也有哥哥（炫峯）。\n\n＃汪汪\n其峯家裡養了一隻混種的比特犬，是別人不要的，眼睛是藍色的，名字叫藍波。\n\n＃頭目與打獵\n外面的廚房掛了很多動物骨頭，因為其峯爺爺之前是頭目。頭目通常每四年會重選一次，打耳祭以及組織部落繁瑣事物是頭目的工作。\n分享許多打獵以及吃山豬肉、山羌肉、老鷹肉的口感還有如何設陷阱捕獵。\n\n＃農忙\n最近種生薑，前陣子小米剛採收完，都會拿去賣。\n""#背景資訊\n跟其峯、其珊媽媽聊天，他說還有一個姐姐在義守大學讀書，只有休假才會回來，也有哥哥（炫峯）。\n\n＃汪汪\n其峯家裡養了一隻混種的比特犬，是別人不要的，眼睛是藍色的，名字叫藍波。\n\n＃頭目與打獵\n外面的廚房掛了很多動物骨頭，因為其峯爺爺之前是頭目。頭目通常每四年會重選一次，打耳祭以及組織部落繁瑣事物是頭目的工作。\n分享許多打獵以及吃山豬肉、山羌肉、老鷹肉的口感還有如何設陷阱捕獵。\n\n＃農忙\n最近種生薑，前陣子小米剛採收完，都會拿去賣。	59	\N
168	25S	2025-07-01	\N	"#阿嬤退休生活\n阿嬤之前做過很多工作，在台北做過水泥工。阿嬤退休後回加拿 有種小米 家裡後面有養雞。梨山的朋友寄水果給阿嬤吃，我們也一起吃李子。\n\n#歐予凡反差\n于凡訓斥我們不要翹腳 吃飯不要滑手機\n阿嬤說小朋友在家都很乖很文靜，在學校比較活潑""#阿嬤退休生活\n阿嬤之前做過很多工作，在台北做過水泥工。阿嬤退休後回加拿 有種小米 家裡後面有養雞。梨山的朋友寄水果給阿嬤吃，我們也一起吃李子。\n\n#歐予凡反差\n于凡訓斥我們不要翹腳 吃飯不要滑手機\n阿嬤說小朋友在家都很乖很文靜，在學校比較活潑"	28	\N
5	24S	2024-07-01	https://drive.google.com/file/d/1NROPrpAynQORqEICM_1NprZ0I8DKm_j-/view?usp=drive_link	#地瓜拔起來，四季豆帶回來 \n加和旁邊的農田遇到振佑的阿嬤，我們走進田裡面一起學怎麼拔地瓜。\n \n最後阿嬤還很慷慨的另外摘了一些四季豆，也把地瓜送給我們當作工錢，這次的農訪的照片也同步上了文建站的粉專! （後續：我跟子崴忘記把裝地瓜的籃子還給阿嬤，25冬上山還被阿嬤念我的籃子哩XD） \n \n#柔道男兒 \n振佑振毅目前都在關山國中學柔道，媽媽在池上下班後，會順路去接他們回家，兩兄弟因近期到高雄比賽不在加拿。	6	\N
162	25S	2025-07-01	https://drive.google.com/file/d/15c7Lz80B1Xh9qod-uOaIsilR_flvGkj7/view?usp=sharing	"和前村長借烤爐 看到村長和幾個村民在殺豬和清理內臟（有包括6/30家訪過的二姐）去6/30家訪過的阿嬤家\n\n#前村長\n前村長：教過我們很多學長，很多都變成博士了。他還有分享過去荷蘭和布農族對峙的故事，那時候布農族戰勝荷蘭，他們很引以為傲！另外還有提到我們借烤爐的時候不用這麼客氣！\n#vava\nVava：Vava真的很硬（個性）Vava的老婆很漂亮！\n覺得他們真的很熱情，很招待我們，離開時也重複好幾次祝福我們未來可以很順遂～\n""和前村長借烤爐 看到村長和幾個村民在殺豬和清理內臟（有包括6/30家訪過的二姐）去6/30家訪過的阿嬤家\n\n#前村長\n前村長：教過我們很多學長，很多都變成博士了。他還有分享過去荷蘭和布農族對峙的故事，那時候布農族戰勝荷蘭，他們很引以為傲！另外還有提到我們借烤爐的時候不用這麼客氣！\n#vava\nVava：Vava真的很硬（個性）Vava的老婆很漂亮！\n覺得他們真的很熱情，很招待我們，離開時也重複好幾次祝福我們未來可以很順遂～\n"	11	\N
163	25S	2025-07-01	https://drive.google.com/file/d/1MsWsnAibq0n8gKm8SjR_e0XKbr3ETm7-/view?usp=sharing	7/5要去花蓮慶祝神父四十週年，要跳舞，也有分享跳過阿趴次\n阿嬤分享文健站玩的遊戲，通常種的東西(包括剛採收的小米)都會賣入市場，比較少自己食用，平常的作息都是早上3:00起晚上9:30睡。\n淑瑩阿嬤從小就住在加拿部落，後來嫁到上面一點，兒子都搬到台中了\n""7/5要去花蓮慶祝神父四十週年，要跳舞，也有分享跳過阿趴次\n阿嬤分享文健站玩的遊戲，通常種的東西(包括剛採收的小米)都會賣入市場，比較少自己食用，平常的作息都是早上3:00起晚上9:30睡。\n淑瑩阿嬤從小就住在加拿部落，後來嫁到上面一點，兒子都搬到台中了	31	\N
165	25S	2025-07-01	\N	"#背景資訊\n牧師原本住在延平鄉，搬到這裡20年了，現在67歲，曾經當過十幾年的軍人，曾經是陸戰隊，後來考上神學院，喜歡唱歌。 妻子是國小學妹，當兵也有再聯絡，兩個女兒都比我們大，在台東當老師。\n\n#家庭裝潢\n家中有很美的漂流木餐桌和一些裝飾，家是關山一個設計師設計的。20年前裝潢費大約十五萬。房齡12年，地震還好沒有造成什麼損失。\n#日常生活\n牧師半年前去高雄，喜歡慢慢開車邊看風景，有吃迴轉壽司。離關山車站的便當比較好吃，家裡有一隻狗叫做巧克力，也有養貓，名字都是小孩取的。\n\n#教會相關\n加樂教會的牧師坐輪椅是因為腳被槍打到，原本是警察。\n花蓮40周年是為了慶祝布農中會的成立，每隔幾年就會慶祝一次。\n""#背景資訊\n牧師原本住在延平鄉，搬到這裡20年了，現在67歲，曾經當過十幾年的軍人，曾經是陸戰隊，後來考上神學院，喜歡唱歌。 妻子是國小學妹，當兵也有再聯絡，兩個女兒都比我們大，在台東當老師。\n\n#家庭裝潢\n家中有很美的漂流木餐桌和一些裝飾，家是關山一個設計師設計的。20年前裝潢費大約十五萬。房齡12年，地震還好沒有造成什麼損失。\n#日常生活\n牧師半年前去高雄，喜歡慢慢開車邊看風景，有吃迴轉壽司。離關山車站的便當比較好吃，家裡有一隻狗叫做巧克力，也有養貓，名字都是小孩取的。\n\n#教會相關\n加樂教會的牧師坐輪椅是因為腳被槍打到，原本是警察。\n花蓮40周年是為了慶祝布農中會的成立，每隔幾年就會慶祝一次。\n"	14	\N
164	25S	2025-07-01	\N	"#背景資訊\n阿嬤有時候會去桃園找小孩，因為腳不好所以也不太出門，常常窩在家中喝飲料看飆車類型的電影，比起桃園嘈雜的環境，阿嬤認為加拿還是比較適合他。\n阿嬤很喜歡手作類型和動動腦的活動，像是最近在做花圈，也會每天都會去文健站，在那邊看其他人打槌球、吹口風琴。\n是加拿天主教堂的成員，最近的活動是在籌備7/4去花蓮表演的舞蹈，和他見面的四次他總是邀請我們去天主教會參觀，也分享了自己和那邊的牧師一起去尋訪耶路撒冷和歐洲各國的故事，也常常反問我們出國經歷和各種問題，是一個超級熱情的人！\n\n#紫色同好\nhumhum 阿嬤的二妹剛好也在家，分享自己有去考了族語檢定。非常喜歡喝酒，也傳授了調酒配方給我們。是一位超級喜歡紫色的阿姨，會很開心地分享身上的紫色配件。""#背景資訊\n阿嬤有時候會去桃園找小孩，因為腳不好所以也不太出門，常常窩在家中喝飲料看飆車類型的電影，比起桃園嘈雜的環境，阿嬤認為加拿還是比較適合他。\n阿嬤很喜歡手作類型和動動腦的活動，像是最近在做花圈，也會每天都會去文健站，在那邊看其他人打槌球、吹口風琴。\n是加拿天主教堂的成員，最近的活動是在籌備7/4去花蓮表演的舞蹈，和他見面的四次他總是邀請我們去天主教會參觀，也分享了自己和那邊的牧師一起去尋訪耶路撒冷和歐洲各國的故事，也常常反問我們出國經歷和各種問題，是一個超級熱情的人！\n\n#紫色同好\nhumhum 阿嬤的二妹剛好也在家，分享自己有去考了族語檢定。非常喜歡喝酒，也傳授了調酒配方給我們。是一位超級喜歡紫色的阿姨，會很開心地分享身上的紫色配件。"	31	\N
167	25S	2025-07-01	\N	"#農忙\n一開始我們進阿諾家，阿諾阿公就送了我們一袋地瓜，後來我們進去聊天，發現阿公有一點重聽，但還是很努力跟我們介紹他們家的生活起居，阿公說他們種地瓜 小米 有送到台灣各地，颱風對他們小米的影響很大，地瓜在土裡沒差，此外家裏還有種青椒、絲瓜、冬瓜、玉米等等作物。\n\n#背景資訊\n阿公67歲 阿嬤63歲，總共有2女兒1個兒子，阿諾是大女兒的兒子。大女兒跟兒子在霧鹿種菜，二女兒在利稻文件站工作。阿諾還有兩個哥哥一個高中一個國中，都在關山。\n\n#阿嬤健康\n後面阿公就請阿嬤來跟我們聊天，有發現阿嬤腳腫一大塊，拿拐杖，阿嬤說有看過醫生，醫生說要多休息，但還是需要工作。\n\n#日常生活\n阿嬤平常都待在家，九點就睡覺了，一個禮拜會去一次關山買豬肉。另外，阿嬤說只有禮拜四、六日沒垃圾車。\n""#農忙\n一開始我們進阿諾家，阿諾阿公就送了我們一袋地瓜，後來我們進去聊天，發現阿公有一點重聽，但還是很努力跟我們介紹他們家的生活起居，阿公說他們種地瓜 小米 有送到台灣各地，颱風對他們小米的影響很大，地瓜在土裡沒差，此外家裏還有種青椒、絲瓜、冬瓜、玉米等等作物。\n\n#背景資訊\n阿公67歲 阿嬤63歲，總共有2女兒1個兒子，阿諾是大女兒的兒子。大女兒跟兒子在霧鹿種菜，二女兒在利稻文件站工作。阿諾還有兩個哥哥一個高中一個國中，都在關山。\n\n#阿嬤健康\n後面阿公就請阿嬤來跟我們聊天，有發現阿嬤腳腫一大塊，拿拐杖，阿嬤說有看過醫生，醫生說要多休息，但還是需要工作。\n\n#日常生活\n阿嬤平常都待在家，九點就睡覺了，一個禮拜會去一次關山買豬肉。另外，阿嬤說只有禮拜四、六日沒垃圾車。\n"	34	\N
169	25S	2025-07-01	https://drive.google.com/file/d/1YGHBH66nU7TSGVgwiIK7JUWR8jUlPm7e/view?usp=sharing	"#背景資訊\nIbu是外婆，Asaku是媽媽，Asaku的布農語沒有很會，都是跟媽媽學。\n\n#日出豪宅\n從以前就在這裡了，有養很多東西種很多東西，像是小葡萄樹酪梨樹、櫻桃橘子火龍果、雞鴨吳郭魚。他們家風景超好，可以看到很多美麗的景色。前方教堂稍微阻擋，原先沒有蓋那麼高。家有兩層樓，說二樓景色好，這邊看日出超美。養雞的話半年就可以殺了，殺魚的話可以用湯匙刮鱗片，會比用刀好哦。\n\n#山服關係\n原先好像不太知道山服的營隊，但家中有人去過營隊（黃絲絨、黃吳孟和）家有很多小孩，包含一個還在嬰兒車裡的以及一個將要出生的。現在沒有去營隊的原因是要照顧更小的小孩。\nAsaku問我們上山來會不會很不方便？甚至還說冬天沒有熱水的話可以提供我們洗澡的地方。\n""#背景資訊\nIbu是外婆，Asaku是媽媽，Asaku的布農語沒有很會，都是跟媽媽學。\n\n#日出豪宅\n從以前就在這裡了，有養很多東西種很多東西，像是小葡萄樹酪梨樹、櫻桃橘子火龍果、雞鴨吳郭魚。他們家風景超好，可以看到很多美麗的景色。前方教堂稍微阻擋，原先沒有蓋那麼高。家有兩層樓，說二樓景色好，這邊看日出超美。養雞的話半年就可以殺了，殺魚的話可以用湯匙刮鱗片，會比用刀好哦。\n\n#山服關係\n原先好像不太知道山服的營隊，但家中有人去過營隊（黃絲絨、黃吳孟和）家有很多小孩，包含一個還在嬰兒車裡的以及一個將要出生的。現在沒有去營隊的原因是要照顧更小的小孩。\nAsaku問我們上山來會不會很不方便？甚至還說冬天沒有熱水的話可以提供我們洗澡的地方。\n"	73	\N
\.


--
-- Data for Name: RelationshipType; Type: TABLE DATA; Schema: public; Owner: neondb_owner
--

COPY public."RelationshipType" ("RelationshipTypeID", "Name", "Source_Role", "Target_Role", "Description") FROM stdin;
2	父子	父親	兒子	\N
3	夫妻	丈夫	妻子	\N
\.


--
-- Data for Name: Students_at_record; Type: TABLE DATA; Schema: public; Owner: neondb_owner
--

COPY public."Students_at_record" ("Account", "Record") FROM stdin;
1	1
2	1
\.


--
-- Data for Name: Villager; Type: TABLE DATA; Schema: public; Owner: neondb_owner
--

COPY public."Villager" ("VillagerID", "Name", "Gender", "Job", "URL", "Photo", "Location", "ContactInfo") FROM stdin;
1	江新武長老	M	長老	https://heyzine.com/flip-book/ae26efff6e.html	\N	5	\N
2	胡阿男牧師	M	牧師	\N	\N	14	\N
3	振佑阿嬤	F	\N	https://heyzine.com/flip-book/ae26efff6e.html	\N	72	\N
4	振佑阿公	M	\N	https://heyzine.com/flip-book/ae26efff6e.html	\N	72	\N
5	振佑媽媽	F	\N	\N	\N	\N	\N
6	包振佑	Ｍ	\N	\N	\N	\N	\N
7	包振毅	Ｍ	\N	\N	\N	\N	\N
8	飛倞爸爸	M	棒球隊教練	\N	\N	\N	\N
9	飛倞媽媽	F	\N	\N	\N	\N	\N
10	邱飛倞	Ｍ	泰源國中	\N	\N	\N	\N
11	邱悅慈	Ｍ	\N	\N	\N	\N	\N
12	邱芷苹	Ｍ	\N	\N	\N	\N	\N
13	志輝媽媽	F	\N	\N	\N	\N	\N
14	邱志輝	F	\N	\N	\N	\N	\N
15	邱志宏	M	\N	\N	\N	\N	\N
16	億凱爸爸	M	\N	\N	\N	\N	\N
17	億凱媽媽	F	\N	\N	\N	\N	\N
18	邱億凱	M	\N	\N	\N	\N	\N
19	邱憫情	M	\N	\N	\N	\N	\N
20	邱憫瑄	M	\N	\N	\N	\N	\N
21	胡家源	M	\N	\N	\N	\N	\N
22	胡育秀	M	\N	\N	\N	\N	\N
23	胡家成	M	\N	\N	\N	\N	\N
24	胡志偉	M	\N	\N	\N	\N	\N
25	胡玉文	F	\N	\N	\N	\N	\N
26	胡志偉	M	\N	\N	\N	\N	\N
27	黃國雄村長	M	\N	\N	\N	\N	\N
28	江愉柔	F	\N	\N	\N	\N	\N
29	江愉玟	F	\N	\N	\N	\N	\N
30	黃詩恩	F	\N	\N	\N	\N	\N
31	詩恩外婆	F	\N	\N	\N	\N	\N
32	Kiuua阿嬤	F	\N	\N	\N	\N	\N
33	胡恩惠	F	\N	\N	\N	\N	\N
34	胡彥呈	M	\N	\N	\N	\N	\N
35	江子榮長老	M	\N	\N	\N	\N	\N
36	貓咪阿公	M	\N	\N	\N	\N	\N
37	Puni阿嬤(貓咪阿嬤)	M	\N	\N	\N	\N	\N
38	斯帖	F	\N	\N	\N	\N	\N
39	田興國長老	M	\N	\N	\N	\N	\N
40	馬樂可	M	社區發展協會理事長	\N	\N	\N	\N
41	雨潔	F	\N	\N	\N	\N	\N
42	賢孫	M	\N	\N	\N	\N	\N
43	佳銘	M	\N	\N	\N	\N	\N
44	于婕	F	\N	\N	\N	\N	\N
45	Biung阿公	M	\N	\N	\N	\N	\N
46	胡志雄	M	\N	\N	\N	\N	\N
47	胡以辰	M	\N	\N	\N	\N	\N
48	胡大哥	M	\N	\N	\N	\N	\N
49	奕萱	F	\N	\N	\N	\N	\N
50	歐妤恩	F	\N	\N	\N	\N	\N
51	歐予凡	M	\N	\N	\N	\N	\N
52	Malas阿姨	F	\N	\N	\N	\N	\N
53	Malas阿姨的姐姐	F	\N	\N	\N	\N	\N
54	古清白大哥	M	\N	\N	\N	\N	\N
55	HumHum(江惠美)阿嬤	F	\N	\N	\N	\N	\N
56	邱晨欣	F	\N	\N	\N	\N	\N
57	邱晨妤	F	\N	\N	\N	\N	\N
58	邱晨蓁	F	\N	\N	\N	\N	\N
59	晨欣阿公	M	\N	\N	\N	\N	\N
60	晨欣阿嬤(邱春妹)	F	\N	\N	\N	\N	\N
61	胡翰翔	M	\N	\N	\N	\N	\N
62	王義群	M	\N	\N	\N	\N	\N
63	王廷睿	M	\N	\N	\N	\N	\N
64	田諾祥	M	\N	\N	\N	\N	\N
65	阿諾爸爸	M	\N	\N	\N	\N	\N
66	阿諾媽媽	F	\N	\N	\N	\N	\N
67	阿諾阿嬤	F	\N	\N	\N	\N	\N
68	胡冠宏	M	\N	\N	\N	\N	\N
69	冠宏阿嬤	F	\N	\N	\N	\N	\N
70	王冠宇	M	\N	\N	\N	\N	\N
71	王品云	F	\N	\N	\N	\N	\N
72	江聰明	M	\N	\N	\N	\N	\N
73	王媽媽(江太太)	F	\N	\N	\N	\N	\N
74	王媽媽	F	\N	\N	\N	\N	\N
75	王涵	F	\N	\N	\N	\N	\N
76	榮哥	M	\N	\N	\N	\N	\N
77	邱恩賜	M	\N	\N	\N	\N	\N
78	江晏均	F	\N	\N	\N	\N	\N
79	Daubas大哥	M	\N	\N	\N	\N	\N
80	天佑爸爸	M	\N	\N	\N	\N	\N
81	天佑媽媽	F	\N	\N	\N	\N	\N
82	江添敏	F	\N	\N	\N	\N	\N
83	江天佑	M	\N	\N	\N	\N	\N
84	雅芳姐	F	\N	\N	\N	\N	\N
85	楊長老	F	\N	\N	\N	\N	\N
86	浩宇姨婆	F	\N	\N	\N	\N	\N
87	欣宜外公	M	\N	\N	\N	\N	\N
88	欣宜爸爸	M	\N	\N	\N	\N	\N
89	欣宜媽媽	F	\N	\N	\N	\N	\N
90	邱欣宜	F	\N	\N	\N	\N	\N
91	邱瀚傑	M	\N	\N	\N	\N	\N
92	胡瀚翔	M	\N	\N	\N	\N	\N
93	韓唯希	F	\N	\N	\N	\N	\N
94	韓唯甯	F	\N	\N	\N	\N	\N
95	Vava	M	\N	\N	\N	\N	\N
96	Umav媽媽	M	\N	\N	\N	\N	\N
97	Umav	M	\N	\N	\N	\N	\N
98	王大哥	M	\N	\N	\N	\N	\N
99	王小哥	M	\N	\N	\N	\N	\N
100	詩恩外婆	F	\N	\N	\N	\N	\N
101	珮瑄爸爸	M	\N	\N	\N	\N	\N
102	珮瑄媽媽	F	\N	\N	\N	\N	\N
103	珮瑄阿嬤	F	\N	\N	\N	\N	\N
104	黃珮瑄	F	\N	\N	\N	\N	\N
105	語恩阿公	M	\N	\N	\N	\N	\N
106	語恩阿嬤	F	\N	\N	\N	\N	\N
107	黃語恩	M	\N	\N	\N	\N	\N
108	田苡潔	F	\N	\N	\N	\N	\N
109	胡軍阿嬤	F	\N	\N	\N	\N	\N
110	胡軍媽媽	F	\N	\N	\N	\N	\N
111	胡軍爸爸	M	\N	\N	\N	\N	\N
112	胡軍	M	\N	\N	\N	\N	\N
113	胡薰	F	\N	\N	\N	\N	\N
114	王欣卉	F	\N	\N	\N	\N	\N
115	王聖恩	M	\N	\N	\N	\N	\N
116	王榮恩	M	\N	\N	\N	\N	\N
117	榮恩媽媽	F	\N	\N	\N	\N	\N
118	蘿莎媽媽	F	\N	\N	\N	\N	\N
119	蘿莎爸爸	M	\N	\N	\N	\N	\N
120	蘿莎	F	\N	\N	\N	\N	\N
121	奧斯汀	M	\N	\N	\N	\N	\N
122	露德	F	\N	\N	\N	\N	\N
123	蘿莎阿嬤	F	\N	\N	\N	\N	\N
124	炫峯媽媽	F	\N	\N	\N	\N	\N
125	炫峯爸爸	M	\N	\N	\N	\N	\N
126	炫峯阿伯	M	\N	\N	\N	\N	\N
127	江采融	F	\N	\N	\N	\N	\N
128	江炫峯	M	\N	\N	\N	\N	\N
129	江其峯	M	\N	\N	\N	\N	\N
130	江其珊	F	\N	\N	\N	\N	\N
131	哲慶阿嬤	F	\N	\N	\N	\N	\N
132	哲慶阿公	M	\N	\N	\N	\N	\N
133	哲慶姑姑	F	\N	\N	\N	\N	\N
134	哲慶姑丈	M	\N	\N	\N	\N	\N
135	余哲遜	M	\N	\N	\N	\N	\N
136	余哲慶	M	\N	\N	\N	\N	\N
137	阿嘎米	F	\N	\N	\N	\N	\N
138	余宗德	M	\N	\N	\N	\N	\N
139	芯蕾媽媽	F	\N	\N	\N	\N	\N
140	林芯蕾	F	\N	\N	\N	\N	\N
141	林浩宇	M	\N	\N	\N	\N	\N
142	邱浩軒	M	\N	\N	\N	\N	\N
143	宗德阿嬤	F	\N	\N	\N	\N	\N
144	宗德叔叔	M	\N	\N	\N	\N	\N
145	Cina Valis	F	\N	\N	\N	\N	\N
146	小Valis	F	\N	\N	\N	\N	\N
147	長老兒子	M	\N	\N	\N	\N	\N
148	余利亞	M	\N	\N	\N	\N	\N
149	江小龍老師	M	\N	\N	\N	\N	\N
150	Puni阿嬤	F	\N	\N	\N	\N	\N
151	金昀	M	\N	\N	\N	\N	\N
152	金昀阿姨	F	\N	\N	\N	\N	\N
153	江語婕	F	\N	\N	\N	\N	\N
154	皓鈞	M	\N	\N	\N	\N	\N
155	皓鈞叔叔	M	\N	\N	\N	\N	\N
156	黃大哥Ula	M	\N	\N	\N	\N	\N
157	Aping阿姨	F	\N	\N	\N	\N	\N
158	江大姐	F	\N	\N	\N	\N	\N
159	王老師	F	\N	\N	\N	\N	\N
160	江大哥	M	\N	\N	\N	\N	\N
161	\N	\N	\N	\N	\N	\N	\N
\.


--
-- Data for Name: VillagerRelationship; Type: TABLE DATA; Schema: public; Owner: neondb_owner
--

COPY public."VillagerRelationship" ("RelationshipID", "SourceVillagerID", "TargetVillagerID", "RelationshipTypeID") FROM stdin;
2	1	3	2
1	1	2	3
\.


--
-- Data for Name: Villagers_at_record; Type: TABLE DATA; Schema: public; Owner: neondb_owner
--

COPY public."Villagers_at_record" ("Villager", "Record") FROM stdin;
1	1
2	1
3	1
\.


--
-- Data for Name: student_list; Type: TABLE DATA; Schema: public; Owner: neondb_owner
--

COPY public.student_list (id, grade_title, student_names, sort_order, updated_at) FROM stdin;
1	100學年	["邱宗平", "王威翔", "王芯卉", "邱嘉柔", "江晏均"]	1	2026-01-13 12:21:38.155765
2	101學年	["胡雨潔", "胡奕萱", "胡家源", "胡紘維", "邱慈軒", "黃皓均", "江采融", "黃金昀"]	2	2026-01-13 12:21:38.155765
3	102學年	["張俊凱", "余哲遜", "邱欣宜", "邱恩賜", "江添敏", "胡軍", "胡惟伶", "韓唯希"]	3	2026-01-13 12:21:38.155765
4	103學年	["余哲慶", "胡翰翔", "王義群", "余佳銘", "蘿莎・阿道"]	4	2026-01-13 12:21:38.155765
5	104學年	["王榮恩", "余斯帖", "胡以辰", "王冠宇"]	5	2026-01-13 12:21:38.155765
6	105學年	["包振佑", "黃珮瑄", "邱瀚傑", "胡冠宏", "邱晨欣", "黃詩恩", "奧思汀・阿道", "江愉柔", "胡育秀"]	6	2026-01-13 12:21:38.155765
7	106學年	["黃語恩", "胡薰", "包振毅", "邱志輝", "邱飛倞", "邱億凱", "余宗德", "王廷睿"]	7	2026-01-13 12:21:38.155765
8	107學年	["邱晨好", "江天佑", "江炫峯", "張昕冉", "邱瀚祥", "韓唯甯"]	8	2026-01-13 12:21:38.155765
9	108學年	["邱志宏", "林芯蕾", "邱悅慈", "江語婕"]	9	2026-01-13 12:21:38.155765
10	109學年	["王涵", "邱晨蓁", "王品云", "甲苡潔", "胡家成", "林浩宇", "露德・阿道", "古喬恩"]	10	2026-01-13 12:21:38.155765
11	110學年	["邱憫情", "邱芷苹", "陳于婕"]	11	2026-01-13 12:21:38.155765
12	111學年	["邱浩軒", "胡王文", "江其峯"]	12	2026-01-13 12:21:38.155765
13	112學年	["江曉瑛", "邱憫瑄", "胡志偉", "林嘉程", "田諾祥"]	13	2026-01-13 12:21:38.155765
\.


--
-- Name: Account_AccountID_seq; Type: SEQUENCE SET; Schema: public; Owner: neondb_owner
--

SELECT pg_catalog.setval('public."Account_AccountID_seq"', 2, true);


--
-- Name: Record_RecordID_seq; Type: SEQUENCE SET; Schema: public; Owner: neondb_owner
--

SELECT pg_catalog.setval('public."Record_RecordID_seq"', 171, true);


--
-- Name: RelationshipType_RelationshipTypeID_seq; Type: SEQUENCE SET; Schema: public; Owner: neondb_owner
--

SELECT pg_catalog.setval('public."RelationshipType_RelationshipTypeID_seq"', 3, true);


--
-- Name: VillagerRelationship_RelationshipID_seq; Type: SEQUENCE SET; Schema: public; Owner: neondb_owner
--

SELECT pg_catalog.setval('public."VillagerRelationship_RelationshipID_seq"', 5, true);


--
-- Name: Villager_VillagerID_seq; Type: SEQUENCE SET; Schema: public; Owner: neondb_owner
--

SELECT pg_catalog.setval('public."Villager_VillagerID_seq"', 4, true);


--
-- Name: locations_id_seq; Type: SEQUENCE SET; Schema: public; Owner: neondb_owner
--

SELECT pg_catalog.setval('public.locations_id_seq', 15, true);


--
-- Name: student_rosters_id_seq; Type: SEQUENCE SET; Schema: public; Owner: neondb_owner
--

SELECT pg_catalog.setval('public.student_rosters_id_seq', 13, true);


--
-- Name: Account Account_pkey; Type: CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public."Account"
    ADD CONSTRAINT "Account_pkey" PRIMARY KEY ("AccountID");


--
-- Name: Record Record_pkey; Type: CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public."Record"
    ADD CONSTRAINT "Record_pkey" PRIMARY KEY ("RecordID");


--
-- Name: RelationshipType RelationshipType_Name_key; Type: CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public."RelationshipType"
    ADD CONSTRAINT "RelationshipType_Name_key" UNIQUE ("Name");


--
-- Name: RelationshipType RelationshipType_pkey; Type: CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public."RelationshipType"
    ADD CONSTRAINT "RelationshipType_pkey" PRIMARY KEY ("RelationshipTypeID");


--
-- Name: Students_at_record Students_at_record_pkey; Type: CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public."Students_at_record"
    ADD CONSTRAINT "Students_at_record_pkey" PRIMARY KEY ("Account", "Record");


--
-- Name: VillagerRelationship VillagerRelationship_pkey; Type: CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public."VillagerRelationship"
    ADD CONSTRAINT "VillagerRelationship_pkey" PRIMARY KEY ("RelationshipID");


--
-- Name: Villager Villager_pkey; Type: CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public."Villager"
    ADD CONSTRAINT "Villager_pkey" PRIMARY KEY ("VillagerID");


--
-- Name: Villagers_at_record Villagers_at_record_pkey; Type: CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public."Villagers_at_record"
    ADD CONSTRAINT "Villagers_at_record_pkey" PRIMARY KEY ("Villager", "Record");


--
-- Name: Location locations_pkey; Type: CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public."Location"
    ADD CONSTRAINT locations_pkey PRIMARY KEY ("LocationID");


--
-- Name: student_list student_rosters_pkey; Type: CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public.student_list
    ADD CONSTRAINT student_rosters_pkey PRIMARY KEY (id);


--
-- Name: ix_locations_id; Type: INDEX; Schema: public; Owner: neondb_owner
--

CREATE INDEX ix_locations_id ON public."Location" USING btree ("LocationID");


--
-- Name: ix_locations_name; Type: INDEX; Schema: public; Owner: neondb_owner
--

CREATE INDEX ix_locations_name ON public."Location" USING btree (name);


--
-- Name: Students_at_record Account; Type: FK CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public."Students_at_record"
    ADD CONSTRAINT "Account" FOREIGN KEY ("Account") REFERENCES public."Account"("AccountID");


--
-- Name: Record At; Type: FK CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public."Record"
    ADD CONSTRAINT "At" FOREIGN KEY ("Location") REFERENCES public."Location"("LocationID");


--
-- Name: Record By; Type: FK CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public."Record"
    ADD CONSTRAINT "By" FOREIGN KEY ("Account") REFERENCES public."Account"("AccountID");


--
-- Name: Villager Lives_at; Type: FK CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public."Villager"
    ADD CONSTRAINT "Lives_at" FOREIGN KEY ("Location") REFERENCES public."Location"("LocationID");


--
-- Name: Students_at_record Record; Type: FK CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public."Students_at_record"
    ADD CONSTRAINT "Record" FOREIGN KEY ("Record") REFERENCES public."Record"("RecordID");


--
-- Name: Villagers_at_record Record; Type: FK CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public."Villagers_at_record"
    ADD CONSTRAINT "Record" FOREIGN KEY ("Record") REFERENCES public."Record"("RecordID");


--
-- Name: Villagers_at_record Villager; Type: FK CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public."Villagers_at_record"
    ADD CONSTRAINT "Villager" FOREIGN KEY ("Villager") REFERENCES public."Villager"("VillagerID");


--
-- Name: VillagerRelationship constraint_1; Type: FK CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public."VillagerRelationship"
    ADD CONSTRAINT constraint_1 FOREIGN KEY ("SourceVillagerID") REFERENCES public."Villager"("VillagerID");


--
-- Name: VillagerRelationship constraint_2; Type: FK CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public."VillagerRelationship"
    ADD CONSTRAINT constraint_2 FOREIGN KEY ("TargetVillagerID") REFERENCES public."Villager"("VillagerID");


--
-- Name: VillagerRelationship constraint_3; Type: FK CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public."VillagerRelationship"
    ADD CONSTRAINT constraint_3 FOREIGN KEY ("RelationshipTypeID") REFERENCES public."RelationshipType"("RelationshipTypeID");


--
-- Name: DEFAULT PRIVILEGES FOR SEQUENCES; Type: DEFAULT ACL; Schema: public; Owner: cloud_admin
--

ALTER DEFAULT PRIVILEGES FOR ROLE cloud_admin IN SCHEMA public GRANT ALL ON SEQUENCES TO neon_superuser WITH GRANT OPTION;


--
-- Name: DEFAULT PRIVILEGES FOR TABLES; Type: DEFAULT ACL; Schema: public; Owner: cloud_admin
--

ALTER DEFAULT PRIVILEGES FOR ROLE cloud_admin IN SCHEMA public GRANT ALL ON TABLES TO neon_superuser WITH GRANT OPTION;


--
-- PostgreSQL database dump complete
--

\unrestrict xj872racHczgrqSbeTbuiyOgja5yjvL1aY7mfmJhThxKHbDLvv9luO7n8tXNm7J

